
NSIS Working Group                                         Attila Bader
INTERNET-DRAFT                                            Lars Westberg
                                                               Ericsson
Expires: July 2005                                 Georgios Karagiannis
                                                   University of Twente
                                                       Cornelia Kappler
                                                                Siemens
                                                             Tom Phelan
                                                                  Sonus
                                                      February 15, 2005


       RMD-QOSM - The Resource Management in Diffserv QoS model
                <draft-ietf-nsis-rmd-01.txt>

Status of this memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of RFC 3668.

   "Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups. Note that other
   groups may also distribute working documents as Internet-Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than a "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/1id-abstracts.html

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html" 


Abstract

   This document describes an NSIS QoS Model for 
   networks that use the Resource Management in Diffserv (RMD) 
   concept.  RMD is a technique for adding admission control to 
   Differentiated Services (Diffserv) networks.  RMD complements 
   the Diffserv architecture by pushing complex classification, 
   conditioning and admission control functions to the edges of a 
   Diffserv domain and simplifying the operation of internal nodes.  
   The RMD QoS Model allows devices external to the RMD network to 
   signal reservation requests to edge nodes in the RMD network. RMD 
   ingress edge nodes aggregate the requests and signal the aggregated 
   requests through internal nodes along the data path to the egress 
   edge nodes.  Egress nodes reconstitute the original, disaggregated, 
   requests and continue forwarding them along the data path towards 
   the final destination.


Bader, et al.                                                  [Page 1]

INTERNET-DRAFT                                                 RMD-QOSM



Table of Contents

   1. Introduction . . . . . . . . . . . . . . . . . . . . . . . . 3
   2. Terminology . . . . . . . . . . . . . . . . . . . . . . . . .3
   3. Overview of RMD and RMD-QOSM . . . . . . . . . . . . . .. . .4
      3.1 RMD . . . . . . . . . . . . . . . . . . . . . . . . . . .4
      3.2 RMD-QOSM . . . . . . . . . . . . . . . . . . . . . . . . 6
          3.2.1 Role of the QNEs . . . . . . . .. . . . . . . . . .6
          3.2.2 RMD-QOSM signaling . . . . . . . . . . . . . . . . 7
   4. RMD-QOSM, Detailed Description . . . . . . . . . . . .. . . .8
      4.1 RMD-QSpec Definition . . . . . . . . . . . . . . . . . . 9
          4.1.1 RMD-QOSM QoS descriptor . . . . . . . . . . . . . .9
          4.1.2 PHR RMD-QOSM control information . . . . . . . . . 9
          4.1.3 PDR RMD-QOSM control information  . . . . . . . . 11
          4.1.4 Mapping of QSpec parameters onto generic 
                QSpec Parameters . . . . . . . . . . . . . . . . .13
      4.2 Message format . . . . . . . . . . . . . . . . . . . . .13
      4.3 RMD node state management . . . . . . . . . . . . . . . 14
      4.4 Operation and sequence of events . . . . . . . . . . . .16
          4.4.1 Edge discovery and addressing of messages . . . . 16
          4.4.2 Basic unidirectional operation . . . . . . . . . .17
             4.4.2.1 Successful reservation. . . . . . . . . . . .17
             4.4.2.2 Unsuccessful reservation . . . . . . . . . . 22
             4.4.2.3 RMD refresh reservation. . . . . . . . . . . 23
             4.4.2.4 RMD modification of reservation. . . . . . . 28
             4.4.2.5 RMD release procedure. . . . . . . . . . . . 28
             4.4.2.6 Severe congestion handling  . . . . . . . . .34
          4.4.3 Bidirectional operation . . . . . . . . . . . . . 37
             4.4.3.1 Successful and unsuccessful reservation . . .38
      4.5 Handling of additional errors . . . . . . . . . . . . . 42
   5. Security Consideration. . . . . . . . . . . . . . . . . . . 42
   6. IANA Considerations. . . . . . . . . . . . . . . . . . . . .43
   7. Open issues. . . . . . . . . . . . . . . . . . . . . . . . .44
      7.1 Explicit congestion notification . . . . . . . . . . . .44
      7.2 Bidirectional severe congestion handling . . . . . . . .44
   8. Acknowledgments. . . . . . . . . . . . . . . . . . . . . . .44
   9. Authors' Addresses. . . . . . . . . . . . . . . . . . . . . 44
   10. Normative References . . . . . . . . . . . . . . . . . . . 45
   11. Informative References . . . . . . . . . . . . . . . . . . 45
   12. Intellectual Property Rights . . . . . . . . . . . . . . . 46



Bader, et al.                                                  [Page 2]

INTERNET-DRAFT                                                 RMD-QOSM

1.  Introduction

   This document describes a Next Steps In Signaling (NSIS) QoS model 
   for networks that use the Resource Management in Diffserv (RMD) 
   framework ([RMD1], [RMD2], [RMD3]).  RMD adds admission control to 
   Diffserv networks and allows nodes external to the networks to 
   dynamically reserve resources within the Diffserv domains. RMD 
   describes the following procedures:

   * aggregation of individual resource reservation or resource query 
     requests at the ingress node of the domain, 

   * hop-by-hop admission control (of aggregated requests) within the 
     domain. There are two possible modes of operation for internal 
     nodes to admit aggregated requests. One mode is the stateless or 
     measurement-based mode, where the resources within the domain are 
     queried. Another mode of operation is the reduced-state 
     reservation or reservation based mode, where the resources within 
     the domain are reserved.

   * a method to forward the original requests across the domain up to 
     the egress node and beyond.

   * a congestion control algorithm that is able to terminate the 
     appropriate number of flows in case a of congestion due to a 
     sudden failure (e.g., link, router) within the domain.
   
   The Quality of Service NSIS Signaling Layer Protocol (QoS-NSLP) 
   [QoS-NSLP] specifies a generic model for carrying Quality of Service 
   (QoS) signaling information end-to-end in an IP network.  Each 
   network along the end-to-end path is expected to implement a 
   specific QoS Model (QOSM) that interprets the requests and installs 
   the necessary mechanisms, in a manner that is appropriate to the 
   technology in use in the network, to ensure the delivery of the 
   requested QoS.
   
   This document specifies a QoS Model for RMD networks(RMD-QOSM), and 
   an RMD-specific QSpec (RMD-QSPec) for expressing reservations in a 
   suitable form for simple processing by internal nodes.  They are 
   used in combination with the QoS-NSLP to provide QoS-NSLP service in 
   an RMD network.  

   Internally to the RMD network, RMD-QOSM uses the stateless/reduced 
   state operation mode of QoS-NSLP and defines a scalable QoS 
   signaling model in which per flow QoS-NSLP and NTLP states are not 
   stored in internal nodes but per flow signaling is performed (see 
   [QoS-NSLP]).
   
   In the RMD-QOSM, only routers at the edges of a Diffserv domain 
   support the QoS-NSLP stateful operation.  Internal routers support 
   either the QoS-NSLP stateless operation, or a reduced-state 
   operation with coarser granularity than the edge nodes.

Bader, et al.                                                  [Page 3]

INTERNET-DRAFT                                                 RMD-QOSM

   The remainder of this draft is structured following the suggestions 
   in Appendix B of [QSP-T] for the description of QoS Signaling 
   Policies: 
  
   After the terminology in Section 2, we give an overview of RMD and 
   the RMD-QOSM in Section 3.  In Section 4 we give a detailed 
   description of the RMD-QOSM, including the role of QNEs, the 
   definition of the QSpec, mapping of QSpec generic parameters onto 
   RMD-QOSM parameters, state management in QNEs, and operation and 
   sequence of events.  Section 5 discusses security issues.
   
   
2.  Terminology
   
   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL 
   NOT", "SHOULD, "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" 
   in this document are to be interpreted as described in RFC 2119.
   

   The terminology defined by GIMPS [GIMPS] and QoS-NSLP [QoS-NSLP] 
   applies to this draft.

   In addition, the following terms are used:

   Edge node: an (NSIS-capable) node on the boundary of some
   administrative domain.

   Ingress node: An edge node that handles the traffic as it enters the
   domain.

   Egress node: An edge node that handles the traffic as it leaves the
   domain.

   Interior nodes: the set of (NSIS-capable) nodes which form an
   administrative domain, excluding the edge nodes.


3.  Overview of RMD and RMD-QOSM

3.1.  RMD
   
   The Differentiated Services (Diffserv) architecture ([RFC2475], 
   [RFC2638]) was introduced as a result of efforts to avoid the 
   scalability and complexity problems of Intserv [RFC1633].  
   Scalability is achieved by offering services on an aggregate 
   rather than per-flow basis and by forcing as much of the per-flow 
   state as possible to the edges of the network.  The service 
   differentiation is achieved using the Differentiated Services (DS) 
   field in the IP header and the Per-Hop Behavior (PHB) as the main 
   building blocks.  Packets are handled at each node according to the 
   PHB indicated by the DS field in the message header.

Bader, et al.                                                  [Page 4]

INTERNET-DRAFT                                                  RMD-QOSM

   The Diffserv architecture does not specify any way for devices 
   outside the domain to dynamically reserve resources or receive 
   indications of network resource availability.  In practice, service 
   providers rely on subscription-time Service Level Agreements (SLAs) 
   that statically define the parameters of the traffic that will be 
   accepted from a customer.
   
   RMD was introduced as a method for dynamic reservation of resources 
   within a Diffserv domain.  It describes a method that is able to 
   provide admission control for flows entering the domain and a 
   congestion handling algorithm that is able to terminate flows in 
   case of congestion due to a sudden failure (e.g., link, router) 
   within the domain. 
   
   In RMD, scalability is achieved by separating a complex reservation 
   mechanism used in the edge nodes of a Diffserv domain from a much 
   simpler reservation mechanism needed in the interior nodes.  In 
   particular, it is assumed that edge nodes support per-flow QoS 
   states in order to provide QoS guarantees for each flow. Interior 
   nodes use only one aggregated reservation state per traffic class or 
   no states at all. In this way it is possible to handle large numbers 
   of flows in the interior nodes. Furthermore, due to the limited 
   functionality supported by the interior nodes, this solution allows 
   fast processing of signaling messages. 
   
   In RMD two basic operation modes are described: measurement-based 
   admission control and reservation-based admission control.  The 
   measurement-based algorithm continuously measures traffic levels and 
   the actual available resources, and admits flows whose resource 
   needs are within what is available at the time of the request.  Once 
   an admission decision is made, no record of the decision need be 
   kept.  The advantage of measurement-based resource management 
   protocols is that they do not require pre-reservation state or 
   explicit release of the reservations.  Moreover, when the user 
   traffic is variable, measurement based admission control could 
   provide higher network utilization than, e.g., peak-rate 
   reservation.  However, this can introduce an uncertainty in the 
   availability of the resources.

   With the reservation-based method, each interior node maintains 
   only one reservation state per traffic class.  The ingress edge 
   nodes aggregate individual flow requests into classes, and signal 
   changes in the class reservations as necessary.  The reservation is 
   quantified in terms of resource units.  These resources are 
   requested dynamically per PHB and reserved on demand in all nodes in 
   the communication path from an ingress node to an egress node.
   
   
Bader, et al.                                                  [Page 5]

INTERNET-DRAFT                                                 RMD-QOSM

3.2. Basic features of RMD-QOSM

3.2.1 Role of the QNEs

   RMD-QOSM is a QoS-NSLP QoS model for networks that uses RMD.  The 
   protocol model of the RMD-QOSM is shown in Figure 1.  The figure 
   shows QNI and QNR nodes, not part of the RMD network, that are the 
   ultimate initiator and receiver of the QoS reservation requests.  It 
   also shows QNF nodes that are the ingress and egress nodes in the 
   RMD domain (QNF Ingress and QNF Egress), and QNF nodes that are 
   interior nodes (QNF Interior).

   All nodes of the RMD domain are QoS-NSLP aware nodes.  Edge nodes 
   store and maintain QoS-NSLP and NTLP states and therefore are 
   stateful nodes.  The interior nodes are NTLP stateless. Furthermore 
   they are either QoS-NSLP stateless (for measurement-based 
   operation), or are reduced state nodes storing per PHB aggregated 
   QoS-NSLP states (for reservation-based operation). Note that for 
   both cases, the interior nodes do not store any NTLP states. 
   
     |------|   |-------|                           |------|   |------|
     | e2e  |<->| e2e   |<------------------------->| e2e  |<->| e2e  |
     | QoS  |   | QoS   |                           | QoS  |   | QoS  |
     |      |   |-------|                           |------|   |------|
     |      |   |-------|   |-------|   |-------|   |------|   |      |
     |      |   | local |<->| local |<->| local |<->| local|   |      |
     |      |   | QoS   |   |  QoS  |   |  QoS  |   |  QoS |   |      |
     |      |   |       |   |       |   |       |   |      |   |      |
     | NSLP |   | NSLP  |   | NSLP  |   | NSLP  |   | NSLP |   | NSLP |
     |st.ful|   |st.ful |   |st.less|   |st.less|   |st.ful|   |st.ful|
     |      |   |       |   |red.st.|   |red.st.|   |      |   |      |
     |      |   |-------|   |-------|   |-------|   |------|   |      |
     |------|   |-------|   |-------|   |-------|   |------|   |------|
     ------------------------------------------------------------------
     |------|   |-------|   |-------|   |-------|   |------|   |------|
     | NTLP |<->| NTLP  |<->| NTLP  |<->| NTLP  |<->| NTLP |<->|NTLP  |
     |st.ful|   |st.ful |   |st.less|   |st.less|   |st.ful|   |st.ful|
     |------|   |-------|   |-------|   |-------|   |------|   |------|
       QNI         QNF        QNF         QNF          QNF       QNR
     (End)  (Ingress) (Interior)  (Interior) (Egress)  (End)
   
         st.ful: stateful, st.less: stateless
         st.less red.st.: stateless or reduced state
   
   Figure 1: Protocol model of stateless/reduced state operation


Bader, et al.                                                  [Page 6]

INTERNET-DRAFT                                                 RMD-QOSM

   Note that the RMD-QOSM domain MAY contain interior nodes that are 
   not NSIS aware nodes (not shown in the figure).  These nodes are 
   assumed to have sufficient capacity for flows that might be 
   admitted.  Furthermore, some of these NSIS unaware nodes MAY be used 
   for measuring the traffic congestion level on the data path. These 
   measurements can be used by RMD-QOSM in the severe congestion 
   operation (see Section 4.4.2.6).


3.2.2 RMD-QOSM signaling

   The basic RMD-QOSM signaling is shown in Figure 2.  A RESERVE 
   message is created by a QNI with a generic QSpec describing the 
   reservation and forwarded along the path towards the QNR.  When the 
   RESERVE message arrives at the ingress node, an RMD-QSpec is 
   constructed. The RMD-QSpec is sent in a local, independent RESERVE 
   message through the interior nodes towards the QNR. This RESERVE 
   message uses the NTLP hop-by-hop datagram signaling mechanism.  
   Meanwhile, the original RESERVE message is sent to the egress node 
   on the path to the QNR using the reliable transport mode of NTLP. 

   Each node on the data path processes the local RESERVE message and 
   checks the availability of resources with either the 
   reservation-based or the measurement-based method.  If an 
   intermediate node cannot accommodate the new request, it indicates 
   this by marking a single bit in the message, and continues 
   forwarding the message.  When the message reaches the egress node, 
   if no intermediate node has denied the reservation, the original 
   RESERVE message is forwarded to the next domain.  When the egress 
   node receives a RESPONSE message from the downstream end, it is 
   forwarded directly to the ingress node.

   If an interior node has denied the reservation, then the reservation 
   fails and a RESPONSE message is sent directly from the egress node 
   to the ingress node. 

   The intra-domain (local) messages used by the RMD-QOSM MUST operate 
   in the NTLP/GIMPS Datagram mode (see [GIMPS]).  Therefore, the NSLP 
   functionality available in all QoS NSLP nodes that are able to 
   support the RMD-QOSM MUST require the intra-domain GIMPS 
   functionality available in these nodes to operate in the datagram 
   mode, i.e., require GIMPS to:
   
   * operate in unreliable mode,
   
   * do not create a message association state
   
   * do not create a reverse path routing state.
   
Bader, et al.                                                  [Page 7]

INTERNET-DRAFT                                                RMD-QOSM

   As a consequence in the stateless/reduced state domain only sender-
   initiated reservation can be performed and functions requiring per 
   flow NTLP or QoS-NSLP states, like summary refreshes, cannot be 
   used. One of the basic features of RMD is that, if per flow 
   identification, is needed, i.e. associating the flows IDs for the 
   reserved resources, Edge nodes act on behalf of Interior nodes.

              QNF             QNF             QNF            QNF
            ingress         interior        interior        egress
        NTLP stateful  NTLP stateless  NTLP stateless  NTLP stateful
               |               |               |              |
       RESERVE |               |               |              |
      -------->| RESERVE       |               |              |
               +--------------------------------------------->|
               | RESERVE'      |               |              |
               +-------------->|               |              |
               |               | RESERVE'      |              |
               |               +-------------->|              |
               |               |               | RESERVE'     |
               |               |               +------------->|
               |               |               |              | RESERVE
               |               |               |              +-------->
               |               |               |              | RESPONSE
               |               |               |              |<--------
               |               |               |     RESPONSE |
               |<---------------------------------------------+
       RESPONSE|               |               |              |
      <--------|               |               |              |
   
   Figure 2: Sender-initiated reservation with Reduced State Interior
             Nodes
   
   
4.  RMD-QOSM, Detailed Description
   
   This section describes RMD-QOSM in more detail.  In particular, 
   it defines the role of stateless and reduced-state QNEs, the 
   RMD-QOSM QSpec Object, the format of RMD-QOSM QoS-NSLP messages 
   and how QSpecs are processed and used in different protocol 
   operations.  
   
Bader, et al.                                                  [Page 8]

INTERNET-DRAFT                                                RMD-QOSM

4.1.  RMD-QSpec Definition
   
   The RMD-QOSMQSpec object contains three fields, the "RMD-QOSM QoS 
   descriptor", the Per Hop Reservation "PHR RMD-QOSM control 
   information" and the Per Domain Reservation "PDR RMD-QOSM control 
   information".  The "RMD-QOSM QoS descriptor" and the "PHR RMD-QOSM 
   control information" fields are used and processed by edge and 
   interior nodes.  The "PDR RMD-QOSM control information" field is 
   only processed by edge nodes.  The "PHR RMD-QOSM control 
   information" field contains the QoS specific control 
   information for intra-domain communication and reservation.  The 
   "PDR RMD-QOSM control information" contains additional information 
   that is needed by the edge nodes and is not available (carried) by 
   the "PHR RMD-QOSM control information".  Note that it is required 
   that the consistency between the RMD-QOSM QSpec parameters and the 
   QSpec Template draft [QSP-T] should be ensured. 


4.1.1.  RMD-QOSM QoS descriptor
   
   This section describes the parameters used by the "RMD-QOSM QoS 
   descriptor" field.  The RMD-QOSM QoS descriptor only contains the
   QoS Desired object [QSP-T]. It does not contain the QoS 
   Available, QoS Reserved or Minimum QoS objects.

<RMD-QOSM QoS descriptor> = <QoS Desired>
   
   <QoS Desired> = <Bandwidth> <PHB-CLASS> 


4.1.2.  PHR RMD-QOSM control information 
   
   This section describes the parameters used by the "PHR RMD-QOSM 
   control information" field. The <NSLP hops> and<Max NSLP Hops> 
   parameters are defined in <QSM-T>.  All other parameters are 
   specific to RMD-QOSM.
   
   <PHR RMD-QOSM control information> = <PHR Type> <Control Type> 
   <S> <Overload %> <M> <NSLP Hops> <Hop_U> <B> <Time Lag>

   <PHR Type>:
   4-bit field.  This specifies the per hop reservation type.  
   For the reservation based RMD, the value MUST be 1.  For the 
   measurement based PHR this value MUST be 2.
   
   <Control Type>:
   4 bit field, indicating the "PHR RMD-QOSM control information" 
   type: PHR_Resource_Request, PHR_Release_Request, 
   PHR_Refresh_Update.  It is used to further specify QoS-NSLP 
   RESERVE and RESPONSE messages.

Bader, et al.                                                  [Page 9]

INTERNET-DRAFT                                                 RMD-QOSM
   
   "PHR_Resource_Request" (Control Type = 1): initiate or update 
   the traffic class reservation state on all nodes located on 
   the communication path between the QNF(ingress) and 
   QNF(egress) nodes.
   
   "PHR_Refresh_Update" (Control Type = 2): refresh the traffic 
   class reservation soft state on all nodes located on the 
   communication path between the QNF(ingress) and QNF(egress) 
   nodes according to a resource reservation request that was 
   successfully processed during a previous refresh period.
   
   "PHR_Release_Request" (Control Type = 3): explicitly release, 
   by subtraction, the reserved resources for a particular flow 
   from a traffic class reservation state.
   
   <S> (Severe Congestion):
   1 bit.  In case of a route change refreshing RESERVE messages 
   follow the new data path, and hence resources are requested 
   there.  If the resources are not sufficient to accommodate the new 
   traffic sever congestion occurs.  Congested interior nodes SHOULD 
   notify edge QNFs about the congestion, which is done by setting the 
   S bit. 
   
   <Overload %>: 
   8 bits In case of severe congestion the level of overload is 
   indicated by the Overload %.  Overload % SHOULD be higher than 0 if 
   S bit is set.  If overload in a node is greater than the overload 
   in a previous node then Overload % SHOULD be updated.  
   
   <M>:
   1 bit.  In case of unsuccessful resource reservation or resource 
   query in an interior QNF, this QNF sets the M bit in order to 
   notify the egress QNF.  
   
   <NSLP Hops>:
   8 bit field.  The <NSLP Hops> in RMD domain counts the number of 
   hops where the reservation was successful.  The <NSLP Hops>is set 
   to zero when a RESERVE message enters a domain and increased by one 
   at each interior QNF.  However when a QNF is reached that does not 
   have sufficient resources to admit the reservation, the M Bit is 
   set, and the <NSLP Hops> value is frozen.  
   
   <Hop_U> (NSLP_Hops unset): 
   1-bit. The QNF(ingress) node MUST set the <Hop_U> parameter to 
   0.  This parameter MAY be set to "1" by a node when the node will 
   not increase the <NSLP Hops> value. This is the case when an 
   RMD-QOSM reservation-based node is not admitting the "RMD-QOSM 
   QoS descriptors" and "PHR_Resource_Request" control information 
   fields. When <Hop_U> is set ô1ö the <NSLP Hops> SHOULD NOT be 
   changed.
   
   <B>: 1 bit.  Indicates bi-directional reservation.

Bader, et al.                                                 [Page 10]

INTERNET-DRAFT                                                 RMD-QOSM

   <Time Lag>: 8 bit field.  The time lag used in a sliding window 
   over the refresh period.

   
4.1.3.  PDR RMD-QOSM control information 
   
   This section describes the parameters used by the "PDR RMD-QOSM 
   control information" field.
   
   <PDR type>:
   
   4-bit field identifying the per domain reservation type.  
   
   <PDR Control Type>: 
   
   4-bit field identifying the type of "PDR RMD-QOSM control 
   information" field.  
   
   "PDR_Reservation_Request" (Control Type = 1): generated by the 
   QNF(ingress) node in order to initiate or update the QoS-NSLP 
   per domain reservation state in the QNF(egress) node
   
   "PDR_Refresh_Request" (Control Type = 2): generated by the 
   QNF(ingress) node and sent to the QNF(egress) node to refresh, 
   in case needed, the QoS-NSLP per domain reservation states 
   located in the QNF(egress) node
   
   "PDR_Release_Request" (Control Type = 3): generated and sent 
   by the QNF(ingress) node to the QNF(egress) node to release 
   the per domain reservation states explicitly
   
   "PDR_Reservation_Report" (Control Type = 4): generated and 
   sent by the QNF(egress) node to the QNF(ingress) node to 
   report that a "PHR_Resource_Request" and a 
   "PDR_Reservation_Request" control information fields have been 
   received and that the request has been admitted or rejected
   
   "PDR_Refresh_Report" (Control Type = 5) generated and sent by 
   the QNF(egress) node in case needed, to the QNF(ingress) node 
   to report that a "PHR_Refresh_Update" control information 
   field has been received and has been processed
   
   "PDR_Release_Report" (Control Type = 6) generated and sent by 
   the QNF(egress) node in case needed, to the QNF(ingress) node 
   to report that a "PHR_Release_Request" and a 
   "PDR_Release_Request" control information fields have been 
   received and have been processed
   
   "PDR_Request_Info" (Control Type =7): an object that can be 
   used as a common "PDR_Reservation_Request", 
   "PDR_Refresh_Request", "PDR_Release_Request" and 
   "PDR_Modification_Request"

Bader, et al.                                                 [Page 11]

INTERNET-DRAFT                                                 RMD-QOSM

   "PDR_Congestion_Report" (Control Type = 8): generated and sent 
   by the
   
   QNF(egress) node to the QNF(ingress) node and used for Severe 
   congestion notification 
   
   "PDR_Modification_Request" (Control Type = 9): generated and 
   sent by the QNF(ingress) node to the QNF(egress) node to 
   modify the per domain reservation states located in the 
   QNF(egress) node
   
   "PDR_Modification_Report" (Control Type =10): generated and 
   sent by the QNF(egress) node to QNF(ingress) node to report 
   that the combination of either the "PHR_Resource_Request" and 
   the "PDR_Modification_Request" control information fields or 
   the "PHR_Release_Request" and the "PDR_Modification_Request" 
   control information fields have been received and processed
   
   <PDR S> (Severe Congestion):
   1-bit.  Specifies if a severe congestion situation occurred.  
   It can also carry the <S> parameter of the 
   "PHR_Resource_Request" or "PHR_Refresh_Update" control 
   information fields.  This parameter applies only to 
   "PDR_Reservation_Report", "PDR_Refresh_Report", 
   "PDR_Congestion_Report" and "PDR_Modification_Report" control 
   information fields.
   
   <PDR_Overload %>: 
   8-bit.  Indicates the level of overload to the ingress 
   node.  It includes the Overload % of the 
   "PHR_Resource_Request" or "PHR_Refresh_Update" control 
   information fields.  This parameter applies only to 
   "PDR_Reservation_Report", "PDR_Refresh_Report", 
   "PDR_Congestion_Report" and "PDR_Modification_Report" control 
   information fields.
   
   <PDR M> (Marked):
   1-bit.  Carries the <M> value of the "PHR_Resource_Request" or 
   "PHR_Refresh_Update" control information fields.  This 
   parameter applies only to "PDR_Reservation_Report", 
   "PDR_Refresh_Report", "PDR_Congestion_Report" and 
   "PDR_Modification_Report" control information fields.
   
   <PDR B>: 1 bit Indicates bi-directional reservation.

   <Max NSLP Hops>: 
   8-bit.  The <Max NSLP Hops> value that has been carried by the 
   "PHR RMD control information" field used to identify the RMD 
   reservation based node that admitted or process a 
   "PHR_Resource_Request" control information field

Bader, et al.                                                 [Page 12]

INTERNET-DRAFT                                                 RMD-QOSM

   <EP-Type>:     
   4-bit.  Identifies the used external protocol (External 
   Protocol Type).  If the external protocol is a QoS-NSLP then 
   this parameter carries the QoS-NSLP protocol ID.  Only useful 
   when the intra-domain signaling procedures are used in 
   combination with non-QoS-NSLP end-to-end signaling 
   procedures.  Every edge node MUST be configured to process the 
   EP-Type.  
   
   <PDR Reverse Requested Resources>
   16 bits.  This field only applies when the "B" flag is set to 
   "1".  It specifies the requested number of units of resources 
   that have to be reserved by a node in the reverse direction 
   when the intra-domain signaling procedures require a bi-
   directional reservation procedure.  
   
   <PDR BOUND_SESSION_ID> 
   128 bits.  This parameter has the same format as the 
   BOUND_SESSION_ID object specified in [QoS-NSLP].  It represents 
   the SESSION_ID as specified in GIMPS of the intra domain 
   session that is bounded to the inter domain (end-to-end) session.

   <PDR NONCE> This parameter has the same format and value as the 
   RII object specified in [QoS-NSLP]. An identifier that must be   
  unique within the context of a SESSION_ID, 
   and SHOULD be different every time an end-to-end RESPONSE that 
   carries a QSpec is desired. Used for security considerations. 

   
4.1.4.  Mapping of generic parameters onto RMD QSP parameters
   
   To be provided in a future version of this draft.
   
4.2.  Message format
   
   The format of the messages used by the RMD-QOSM 
   complies with the QoS-NSLP specification.  As specified in [QoS-
   NSLP], for each QoS-NSLP message type, there is a set of rules for 
   the permissible choice of object types.  These rules are specified 
   using Backus-Naur Form (BNF) augmented with square brackets 
   surrounding optional sub-sequences.  The BNF implies an order for 
   the objects in a message.  However, in many (but not all) cases, 
   object order makes no logical difference.  An implementation SHOULD 
   create messages with the objects in the order shown here, but 
   accept the objects in any permissible order.  
   
   The format of a local (intra-domain) RESERVE message used by the 
   RMD-QOSM is:
   
   RESERVE = COMMON_HEADER
              RSN [ RII ] [ REFRESH_PERIOD ] [ BOUND_SESSION_ID ]
              [ POLICY_DATA ] [ RMD-QSPEC]

Bader, et al.                                                 [Page 13]

INTERNET-DRAFT                                                 RMD-QOSM

   The format of a Query message used by the 
   RMD-QOSM is as follows:
   
   QUERY = COMMON_HEADER
              [ RII ][ BOUND_SESSION_ID ]
              [ POLICY_DATA ] [ RMD-QSPEC ]

   
   A QUERY message MUST contain an RII object to indicate a RESPONSE is 
   desired, unless the QUERY is being used to initiate reverse-path 
   state for a receiver-initiated reservation.
   
   The format of a local (intra-domain) RESPONSE message used by 
   the RMD-QOSM is as follows:  
   
   RESPONSE = COMMON_HEADER
                 [ RII / RSN ] ERROR_SPEC
                 [ RMD-QSPEC ]

   The format of an end-to-end RESPONSE message that is used by the 
   RMD-QOSM to carry the PDR RMD control information of 
   the RMD-QSPEC is as follows:
   
   RESPONSE = COMMON_HEADER
                 [ RII / RSN ] ERROR_SPEC [ RMD-QSPEC ] [ *QSPEC ]
   
   The format of a NOTIFY message used by the 
   RMD-QOSM is as follows:
   
     NOTIFY = COMMON_HEADER ERROR_SPEC [ RMD-QSPEC ]
   
   All objects, except the RMD-QSPEC objects, are specified in [QoS-
   NSLP].  
   
   
4.3.  RMD node state management
   
   The QoS-NSLP state creation and management is specified in 
   [QoS-NSLP].  This section describes the state creation and 
   management functions of the Resource Management Function (RMF) in 
   the RMD nodes.  
   
   QNF interior nodes operating in measurement-based mode are QoS-NSLP 
   stateless nodes, i.e., they do not support any QoS-NSLP or 
   NTLP/GIMPS states.  These measurement-based nodes do store two 
   RMD-QOSM states per PHR group.  These states reflect traffic 
   conditions at the node and are not affected by any QoS-NSLP 
   signaling. One state stores the measured user traffic load 
   associated with the PHR group and another state stores the 
   maximum traffic load that can be admitted per PHR group.

Bader, et al.                                                 [Page 14]

INTERNET-DRAFT                                                 RMD-QOSM

   When a measurement-based node receives a local RESERVE message, it 
   compares the requested resources to the available resources (maximum 
   allowed minus current load) for the requested PHR group.  If there 
   are insufficient resources, it sets the <M> bit in the RMD-QSpec.  
   No change to the RMD-QSpec is made when there are sufficient 
   resources.  In either case, the node then forwards the RESERVE 
   along the path towards the destination.  REFRESH and RELEASE 
   messages are not normally generated in the measurement-based mode, 
   but if received SHOULD be forwarded unchanged.

   QNF interior nodes operating in reservation-based mode are QoS-NSLP 
   reduced state nodes, i.e., they do not store NTLP/GIMPS states but 
   they do store per-PHB-aggregated QoS-NSLP states.  For reservation-
   based nodes, per PHB group aggregated reservations states are 
   installed and are maintained by sending intra-domain RESERVE 
   messages.  
 
   The reservation-based PHR installs and maintains one reservation 
   state per PHB, in all the nodes located in the 
   communication path from the QNF ingress node up to the QNF egress 
   node.  This state represents the number of currently reserved 
   resource units that are carried by the PHR object for the admitted 
   incoming flows.  Thus, the QNF ingress node signals only the 
   resource units requested by each flow.  These resource units if 
   admitted are added to the currently reserved resources per PHB.
   
   For each PHB a threshold is maintained that specifies the maximum 
   number of resource units that can be reserved.  This threshold 
   could, for example, be statically configured.  
   
   The per-PHB group reservation states are soft states but explicit 
   release can also be used. When the reservation soft state principle 
   is used, a finite lifetime is set for the length of the reservation. 
   These reservation states are refreshed by sending periodic refresh 
   messages.  The reserved resources for a particular flow can also be 
   explicitly released from a PHB reservation state by means of a PHR 
   release message.  The usage of explicit release enables the 
   instantaneous release of the resources regardless of the length of 
   the refresh period.  This allows a longer refresh period, which also 
   reduces the number of periodic refresh messages.  The refresh period 
   can be refined using a sliding window algorithm described in [RMD1].
   
   The QNF edges maintain either per flow, or aggregated QoS-NSLP 
   reservation states.  Each per flow or aggregated QoS-NSLP 
   reservation state is identified by a NTLP SESSION_ID (see [GIMPS]). 
   In RMD, these states are denoted as PDR states.
   
   In the situation where the QNF edges maintain per aggregated QoS-
   NSLP reservation states then these states will have to maintain the 
   SESSION_ID of the aggregated state, the IP addresses of the ingress 
   and egress nodes, the PHB value and the size of the aggregated 
   reservation, e.g., reserved bandwidth.

Bader, et al.                                                 [Page 15]

INTERNET-DRAFT                                                 RMD-QOSM

   The size of the aggregation is defined as it is specified in Section 
   1.4.4 of [RFC3175].  The size of the aggregated reservations needs 
   to be greater or equal to the sum of bandwidth of the inter domain 
   (end -to end) reservations it aggregates.  Some policy can be used 
   to maintain the amount of required bandwidth on a given aggregated 
   reservation by taking into account the sum of the underlying inter 
   domain (end-to-end) reservations, while endeavoring to change the 

   reservation less frequently.  This MAY require a trend analysis.  
   If there is a significant probability that in the next interval of 
   time the current aggregated reservation is exhausted, the ingress 
   router MUST predict the necessary bandwidth and request it.  If the 
   ingress router has a significant amount of bandwidth reserved but 
   has very little probability of using it, the policy MAY predict the 
   amount of bandwidth required and release the excess.  To increase or 
    decrease the aggregate, the RMD modification procedures SHOULD be 
   used (see Section 4.4.2.4).
   
   
4.4.  Operation and sequence of events
   
   This section describes the operation and the sequence of events in 
   the RMD-QOSM.  
   
   The transport characteristics for the intra-domain (local) 
   reservation model can be different from that of the inter domain 
   (end-to-end) reservation model.  GIMPS can be used in a different 
   way for the edge-to-edge and hop-by-hop sessions, (i.e. sending of 
    messages in datagram mode, and not retaining optional path state, 
   i.e., NTLP stateless mode).  The reduced state reservation can be 
   updated independently of the per-flow inter domain (end-to-end) 
   reservations.
   
   
4.4.1.  Edge discovery and addressing of messages
   
   Mainly, the egress node discovery can be performed either by using 
   the GIMPS discovery mechanism [GIMPS], manual configuration or any 
   other discovery technique.  The addressing of signaling messages 
   depends on the used GIMPS transport mode.  The RMD QoS signaling 
   messages that are processed only by the edge nodes use the peer-peer 
   addressing of the GIMPS connection mode (C).  RMD QoS signaling 
   messages that are processed by all nodes of the Diffserv domain, 
   i.e., edges and interior nodes, use the end-end addressing of the 
   GIMPS datagram (D) mode.  RMD messages addressed to the end node are 
   intercepted and terminated by the egress node.  
   
Bader, et al.                                                 [Page 16]

INTERNET-DRAFT                                                 RMD-QOSM
   
4.4.2.  Basic unidirectional operation
   
   This section describes the basic unidirectional operation and 
   sequence of events of the RMD-QOSM.  The following 
   basic operation cases are distinguished: Successful reservation, 
   Unsuccessful reservation, Refresh, Modification, Release and Severe 
   congestion.  


4.4.2.1.  Successful reservation
   
   This section describes the operation of the RMD-QOSM 
   where a reservation is successfully accomplished.  The QNI generates 
   the initial RESERVE message, and it is forwarded by the NTLP as 
   usual [GIMPS].  The QNFs at the edges of the RMD domain support the 
   local and end-to-end QoS models, which process the RESERVE message 
   differently. 

4.4.2.1.1. Operation in ingress node

   When an end-to-end reservation request (RESERVE) arrives at the 
   ingress node (QNF), after classifying it into the appropriate PHB, 
   the ingress node calculates the requested resource unit and creates 
   a QoS reservation at the QNF ingress node itself.  This state is 
   associated with the SESSION ID.  If the request was satisfied 
   locally, the ingress node generates two RESERVE messages: 
   end-to-end and intra-domain RESERVE messages.  These are bounded 
   together including a BOUND_SESSION_ID in the intra-domain RESERVE 
   message.  The end-to-end RESERVE message is sent to the egress QNF 
   and includes the end-to-end QSpec.  This message is forwarded using 
   facilities provided by the NTLP to bypass the stateless or reduced-
   state nodes, see Figure 3.  After completing the initial discovery 
   phase, the GIMPS connection mode between the QNF ingress and QNF 
   egress can be used.  The QNF ingress node instructs the NTLP to 
   bypass all intermediate nodes towards the egress node for the 
   end-to-end RESERVE message.  In this way all the QNF interior nodes 
   ignore the processing of the end-to-end RESERVE message.  At the 
   egress node the end-to-end RESERVE message is then forwarded as 
   defined in [QoS-NSLP].
   
   For the intra-domain RESERVE message the QoS descriptor used by the 
   QSpec of the end-to-end QoS model needs to be transformed into the 
   <Bandwidth> and <PHB-CLASS> RMD QoS descriptor. In order to 
   make a RMD query or a RMD reservation an intra-domain 
   RESERVE(RMD-QSPEC) message is generated by the QNF ingress.  

   Before generating this message, the RMD-QOSM functionality uses the 
   <Bandwidth> RMD QoS descriptor for admission control:

Bader, et al.                                                 [Page 17]

INTERNET-DRAFT                                                 RMD-QOSM
   
   *  When the RMD reservation-based method is used, the resources 
      specified in <Bandwidth>, are added to the currently 
      reserved resources per traffic class (PHB) and 
      they become a part of the per RMD traffic class (PHB) 
      reservation state.  Furthermore, the value of the <NSLP Hops> 
      field has to be set 
      to one.  
   
   *  When the RMD measurement-based method is used, and admission 
      decision is positive, the MBAC algorithm is updated with these 
      resources.

   The session ID used by the intra-domain RESERVE (RMD-QSPEC) message 
   MUST be associated to a PHB value (<PHB-CLASS>). The IP destination 
   address of this message MUST be the same as the IP destination 
   address of the end-to-end RESERVE message.  The QNF ingress node 
   generates a reservation request "PHR RMD control information" field 
   denoted as "PHR_Resource_Request" and it MAY generate a reservation 
   request "PDR RMD control information" field denoted as 
   "PDR_Reservation_Request".  These two fields together with the "RMD 
   QoS descriptors" field form the RMD-QSPEC object.  This intra-domain 
   RESERVE (RMD-QSPEC) message MUST include a "PHR RMD control 
   information" (PHR_Resource_Request) field, and it MAY include the 
   "PDR RMD control information", (PDR_Reservation_Request) field.  
   The intra-domain RESERVE message MUST be used and/or set by the QNF 
   ingress as follows:
   
   *  the value of the <RSN> object SHOULD be the same as the value 
      of the RSN object of the end-to-end RESERVE message.
   *  the value of the <BOUND_SESSION_ID> object MUST be the session 
      ID associated to the end-to-end RESERVE message.  
   
   *  the SCOPING flag SHOULD not be set, meaning that a default 
      scoping of the message is used.  Therefore, the QNF edges MUST 
      be configured as boundary nodes and the QNF interior nodes 
      MUST be configured as interior (intermediary) nodes.
   
   *  The <RII> object is not included in this message. 
   
   *  the value of the <REFRESH_PERIOD> object MUST be calculated 
      and set by the QNF ingress node.
   
   *  the PHR resource units MUST be included into the <Bandwidth> 
      parameter of the "RMD QoS descriptor" field.
   
   *  the value of the <Control Type> "parameter of the "PHR RMD 
      control information" field object MUST be set to 1, (i.e., 
      PHR_Resource_Request)
   
   *  the value of the <NSLP Hops> parameter in the "PHR RMD control 
      information" MUST be set to "1".  

Bader, et al.                                                 [Page 18]

INTERNET-DRAFT                                                 RMD-QOSM
   
   *  the value of the <Hop_U>parameter in the "PHR RMD control 
      information" MUST be set to "0".

   *  the flag "Acknowledge" (A) MUST be set "OFF"

   *  the "PDR RMD control information" field MUST be included into the 
      RESERVE(RMD-QSPEC): "forward" message.  The value of the PDR 
      <PDR Control Type> is "1", i.e., "PDR_Reservation_Request".

   *  the value of the <PDR NONCE> MUST contain the Response 
      Identification Information value of the ingress QNF, that is 
      unique within a session and different for each message. This 
      field is used for security considerations and its use will be 
      specified in the next version of the draft.

4.4.2.1.2 Operation in the Interior nodes

   The RMD query procedure is used in the case of the RMD measurement 
   based method, while the RMD reservation procedure 
   is used in case of reservation-based method, see e.g., [RMD1].
   
   Each QNF interior node MUST use and/or set the QoS-NSLP and 
   RMD-QOSM parameters of the intra-domain RESERVE (RMD-QSPEC) 
   message as follows: 
   
   *  the values of the <RSN>, <RII>, <REFRESH_PERIOD>, 
      <BOUND_SESSION_ID>, <POLICY_DATA> objects are not changed, 
      i.e., equal to the values set by the QNF ingress. These values
      are not used by the QNF interior;

   *  the flag "Acknowledge" (A) SHOULD be set "OFF"
   
   *  the value of <Bandwidth> parameter of the "RMD QoS 
      descriptors" field is used by the QNF interior node for 
      admission control;
   
   *  in case of the RMD reservation-based procedure, and if these 
      resources are admitted are going to be added to the currently 
      reserved resources per PHB and therefore they will become a 
      part of the per RMD traffic class (PHB) reservation state.  
      Furthermore, the value of the <NSLP Hops> parameter in the 
      "PHR RMD control information" field has to be increased by 
      one.  
   
   *  in case of the RMD measurement based method, and if these 
      resources are admitted, using a MBAC algorithm, the number of 
      this resources will be used to update the MBAC algorithm.


Bader, et al.                                                 [Page 19]

INTERNET-DRAFT                                                 RMD-QOSM

4.4.2.1.3 Operation in the egress node   

   When the intra-domain RESERVE (RMD-QSPEC) is received by the QNF 
   egress node the binding of the session associated with the intra-
   domain RESERVE (RMD-QSPEC) (the PHB session) with the session 
   included in its <BOUND_SESSION_ID> object MUST be accomplished.  The 
   session included in the <BOUND_SESSION_ID> object is the session 
   associated with the end-to-end RESERVE message.
   
   The "PHR RMD control information" field (and if available the "PDR 
   RMD control information") are read and processed by the RMD QoS 
   signaling model functionality.  The value of <Bandwidth> (and 
   <PHB-CLASS>) of the "RMD QoS descriptors" field is used by the 
   QNF egress node for traffic class admission control.
   
   *  In case of the RMD reservation-based procedure, these 
      resources, if are admitted, are added to the currently 
      reserved resources per PHB and therefore they will become a 
      part of the per PHB reservation state.  Furthermore, the value 
      of the <NSLP Hops> parameter in the "PHR RMD control 
      information" field has to be increased by one.
   
   *  In case of the RMD measurement-based method, the MBAC 
      algorithm is updated by the number of these resources, if the 
      admission control decision is positive.  

QNF (ingress)     QNF (interior)        QNF (interior)    QNF (egress)
NTLP stateful    NTLP stateless        NTLP stateless    NTLP stateful
    |                    |                   |                    |
RESERVE                  |                   |                    |
--->|                    |                   |     RESERVE        |
    |------------------------------------------------------------>|
    |RESERVE(RMD-QSPEC)  |                   |                    |
    |------------------->|                   |                    |
    |                    |RESERVE(RMD-QSPEC) |                    |
    |                    |------------------>|                    |
    |                    |                   | RESERVE(RMD-QSPEC) |
    |                    |                   |------------------->|
    |                    |                   |                RESERVE
    |                    |                   |                    |-->
    |                    |                   |                RESPONSE
    |                    |                   |                    |<--
    |                    |RESPONSE(PDR)      |                    |
    |<------------------------------------------------------------|
RESPONSE                 |                   |                    |
<---|                    |                   |                    |
   
Figure 3: Basic operation of successful reservation procedure used by 
          the RMD-QOSM


Bader, et al.                                                 [Page 20]

INTERNET-DRAFT                                                 RMD-QOSM
 
   The end-to-end RESERVE message is only forwarded further if the 
   processing of the intra-domain RESERVE (RMD-QSPEC) message was 
   successful at all nodes in the RMD domain, otherwise the inter 
   domain (end-to-end) reservation is considered as being failed.  
   In return, after a positive response (i.e., successfully processed 
   end-to-end RESPONSE message) the end-to-end RESPONSE message that 
   has been initiated by the QNR arrives at the QNF egress. The QNF 
   egress MUST then include a "PDR RMD control information" field 
   (i.e., PDR_Reservation_Report) into this end-to-end RESPONSE 
   message. Note that for all upstream messages the RAO is not set. 
   Therefore, all interior nodes ignore the end-to-end Response 
   messages. The end-to-end RESPONSE (PDR) message is sent to its 
   upstream QoS-NSLP neighbor.  Note that this message uses 
   NTLP/GIMPS connection mode.

   The non-default values of the objects contained in the end-to-end 
   RESPONSE message MUST be used and/or set by the QNF egress as 
   follows:
   
   *  the values of the <RII/RSN>, <ERROR_SPEC> , [ *QSPEC ] objects 
      are set by the standard QoS-NSLP protocol functions;
   
   *  the value of the <PDR Control Type> parameter of the "PDR RMD 
      control information" field MUST be set to 4 (i.e., 
      PDR_Reservation_Report);
   
   *  the value of the <EP-Type> parameter of the "PDR RMD control 
      information" field MUST be equal to the QoS-NSLP protocol 
      ID;
   
   *  the value of the <PDR BOUND_SESSION_ID> of the "PDR RMD 
      control information" field MUST be equal to the SESSION_ID 
      of the bound intra-domain RMD session.  

   *  the value of the <PDR NONCE> of the "PDR RMD 
      control information" field MUST be equal to the <PDR NONCE>
      value carried by the intra-domain RESERVE(RMD-QSPEC) message
      belonging to the bound intra-domain RMD session. 
   
   This end-to-end RESPONSE (PDR) message is received by the QNF 
   ingress node.  The non-default values of the objects contained in 
   the end-to-end  RESPONSE message that is forwarded out the RMD 
   domain, MUST be used and/or set by the QNF ingress node as follows:
   
   *  the values of the <RII/RSN>, <ERROR_SPEC>, [ *QSPEC ] objects 
      are set by the standard QoS-NSLP protocol functions;
   
Bader, et al.                                                 [Page 21]

INTERNET-DRAFT                                                 RMD-QOSM

   *  the "PDR RMD control information" field has to be processed 
      and removed by the RMD-QOSM functionality in 
      the QNF ingress node.  The RMD QoS model functionality is 
      notified by reading the <PDR M> parameter of the "PDR RMD 
      control information" that the reservation has been successful.
      The QNF ingress nodes SHOULD also de-activate the 
      "NTLP QoS-NSLP-E2E-IGNORE" feature. The value of the received 
      <PDR NONCE> is used for security considerations and its operation
      will be specified in the next version of the draft.


4.4.2.2.  Unsuccessful reservation
   
   This section describes the operation where a request for reservation 
   cannot be satisfied by the RMD-QOSM.  

   
   The QNF ingress, the QNF interior and QNF egress nodes process and 
   forward the end-to-end RESERVE message and the intra-domain 
   RESERVE (RMD-QSPEC) message in the same way as specified in Section 
   4.4.2.1.  The main difference between the unsuccessful operation and 
   successful operation is that one of the QNF nodes does not admit the 
   request due to lack of resources.  This also means that the QNF edge 
   node MUST NOT forward the end-to-end RESERVE message towards the 
   QNR node and it MUST be discarded.
   
   When an end-to-end RESERVE message arrives to the QNF ingress and 
   if there are no resources available locally, the QNF ingress MUST 
   reject this end-to-end RESERVE message and sends a RESPONSE message 
   back to the sender, using a standard QoS-NSLP procedure.

   In case of the RMD reservation based scenario, and if the 
   Intra-domain reservation request (i.e., intra-domain 
   RESERVE(RMD-QSPEC)is not admitted by the QNF interior node then 
   the <Hop_U> and <M> parameters of the "PHR RMD control information" 
   MUST be set to "1".  The <NSLP Hops> counter MUST NOT be increased.

   In case of the RMD measurement based scenario, and if the 
   Intra-domain reservation query (i.e., intra-domain 
   RESERVE(RMD-QSPEC) is not admitted by the MBAC algorithm used at 
   the QNF node, then the <M> parameter of the "PHR RMD control 
   information" field MUST be set to "1".
   
   In general, if a QNF interior node receives a "PHR RMD control 
   information" field, of type "PHR_Resource_Request", with the <M> 
   parameter set to "1" then this "PHR RMD control information" and the 
   "RMD QoS descriptors" fields MUST NOT be processed, i.e., their 
   parameters will neither be read nor modified.

Bader, et al.                                                 [Page 22]

INTERNET-DRAFT                                                 RMD-QOSM

   In the RMD reservation based and RMD measurement 
   based scenario, when the <M> marked intra-domain RESERVE (RMD-QSPEC) 
   is received by the QNF egress node (see Figure 4) a binding of the 
   session associated with the intra-domain RESERVE (RMD-QSPEC) (the 
   PHB session) with the session included in its BOUND_SESSION_ID 
   object MUST be accomplished.  The session included in the 
   <BOUND_SESSION_ID> object is the session associated with the 
   end-to-end RESERVE.
   
   The QNF egress node MUST generate an end-to-end RESPONSE message 
   that will have to be sent to its previous stateful QoS-NSLP hop.  
   This message MUST include a "PDR RMD control information" field (of 
   type PDR_Reservation_Report).  Note that this message will use a 
   NTLP/GIMPS connection mode.  The QNF egress requests from NTLP/GIMPS 
   to activate the QoS-NSLP-E2E-IGNORE feature.  The non-default values 
   of the objects contained in the end-to-end RESPONSE (PDR) message 
   MUST be used and/or set by the QNF egress node as follows:
   
   *  the values of the <RII/RSN>, <ERROR_SPEC>, [ *QSPEC] objects 
      are set by the standard QoS-NSLP protocol functions;
   
   *  the value of the <PDR Control Type> field of the "PDR RMD control 
      information" field MUST be set to "4" (PDR_Reservation_Report);
   
   *  the value of the <NSLP Hops> parameter of the "PHR RMD control 
      information" field included in the received <M> marked intra-
      domain RESERVE (RMD-QSPEC) message MUST be included in the 
      <Max_NSLP Hops> parameter of the "PDR RMD control information" 
      field;

   *  the value of the <PDR M> parameter of the "PDR RMD control 
      information" field MUST be set to "1";
   
   *  the value of the <EP-Type> parameter of the "PDR RMD control 
      information" field MUST be equal to the QoS-NSLP protocol ID;

   
   *  the value of the <PDR BOUND_SESSION_ID> of the "PDR RMD 
      control information" field MUST be equal to the SESSION_ID 
      of the bounded intra-domain RMD session.

      *  the value of the <PDR NONCE> of the "PDR RMD 
      control information" field MUST be equal to the <PDR NONCE>
      value carried by the intra-domain RESERVE(RMD-QSPEC) message
      belonging to the bound intra-domain RMD session. 

   The non-default values of the objects contained in the end-to-end 
   RESPONSE (PDR) message MUST be used and/or set by the QNF ingress 
   node, which receives this message, as follows:
   
   *  the values of the <RII/RSN>, <ERROR_SPEC> ], [*QSPEC] objects 
      are set by standard QoS-NSLP protocol functions;

Bader, et al.                                                 [Page 23]

INTERNET-DRAFT                                                 RMD-QOSM

   *  the PDR object has to be processed and removed by the RMD QoS 
      signaling model functionality in the QNF ingress node.  The 
      RMD QoS model functionality is notified by reading the <PDR M> 
      parameter of the "PDR RMD control information" that the 
      reservation has been unsuccessful.  In case of a RMD 
      reservation based scenario, the RMD-QOSM
      functionality, has to start an RMD release procedure (see Section 
      4.4.2.5).  The QNF ingress nodes SHOULD also de-activate the 
      "NTLP QoS-NSLP-E2E-IGNORE" feature.  


QNF (ingress)    QNF (interior)       QNF (interior)      QNF (egress)
NTLP stateful    NTLP stateless        NTLP stateless    NTLP stateful
    |                    |                   |                    |
RESERVE                  |                   |                    |
--->|                    |                   |     RESERVE        |
    |------------------------------------------------------------>|
    |RESERVE(RMD-QSPEC)  |                   |                    |
    |------------------->|                   |                    |
    |                    |RESERVE(RMD-QSPEC:M =1)                 |
    |                    |------------------>|                    |
    |                    |                   | RESERVE(RMD-QSPEC:M=1)
    |                    |                   |------------------->|
    |                    |RESPONSE(PDR)      |                    |
    |<------------------------------------------------------------|
RESPONSE                 |                   |                    |
<---|                    |                   |                    |
    |RESERVE(RMD-QSPEC: Tear=1, M=1, <NSLP Hops>=<Max_NSLP Hops>) |
    |------------------->|                   |                    |
   
Figure 4: Basic operation during unsuccessful reservation 
          initiation used by the RMD-QOSM   


4.4.2.3 RMD refresh reservation
   
   In case of RMD measurement-based method, QoS-NSLP states in the RMD 
   domain are not maintained, therefore, the end-to-end RESERVE 
   (refresh) message is sent directly to the QNF egress.

   
   The refresh procedure in case of RMD reservation-based method 
   follows a similar scheme as the reservation process, shown in Figure 
   3. If the RESERVE messages arrive within the soft state time-out 
   period, the corresponding number of resource units are not removed. 
   However, the transmissions of the intra-domain and end-to-end 
   (refresh) RESERVE message are not necessarily synchronized.  
   Furthermore, the generation of the end-to-end RESERVE 
   message, by the QNF edges, depends on the locally maintained 
   refreshed interval (see [QoS-NSLP]).   The QoS-NSLP-E2E-IGNORE 
   feature of NTLP/GIMPS MUST be activated by QNF ingress and 
   deactivated by the QNF egress node.

Bader, et al.                                                 [Page 24]

INTERNET-DRAFT                                                 RMD-QOSM

    The ingress node MUST be able to generate a intra-domain (refresh) 
   RESERVE (RMD-QSpec) at any time. Before generating this message, the 
   RMD QoS signaling model functionality is using the RMD traffic class 
   (PHR) resource units for refreshing the RMD traffic class state.
   
   Note that the RMD traffic class refresh periods MUST be equal in 
   all QNF edge and QNF interior nodes and SHOULD be smaller (default: 
   more than two times) than the refresh period at the QNF ingress node 
   used by the end-to-end RESERVE message.   This intra-domain RESERVE 
   (RMD-QSPEC) message MUST include a "RMD QoS descriptors" field and a 
   "PHR control information" field (i.e., PHR_Refresh_Update), and it 
   MAY include a "PDR RMD control information" field, (i.e., 
   PDR_Refresh_Request).
   
   The selection of the IP source and destination address of this 
   message depends on if and how the different inter domain 
   (end-to-end) flows can be aggregated by the QNF ingress node.  Note 
   that this aggregation procedure is different than the RMD traffic 
   class aggregation procedure.  One example approach is the approach 
   used by the RSVP aggregation scenario ([RFC3175]), where the IP 
   source address of this message is the IP address of the aggregator 
   (i.e., QNF ingress) and the IP destination address of this 
   message is the IP address of the De-aggregator (i.e., QNF egress).  
   Another example approach is the approach used in "RSVP Refresh 
   Overhead Reduction Extensions" ([RFC2961]).  If no aggregation 
   procedure is possible then the IP destination address of this 
   message should be equal to the IP destination address of its 
   associated end-to-end RESERVE message.   

   An example of this RMD specific refresh operation can be seen in 
   Figure 5.
 
QNF (ingress)    QNF (interior)        QNF (interior)    QNF (egress)
NTLP stateful    NTLP stateless        NTLP stateless    NTLP stateful
    |                    |                   |                    |
    |RESERVE(RMD-QSPEC)  |                   |                    |
    |------------------->|                   |                    |
    |                    |RESERVE(RMD-QSPEC) |                    |
    |                    |------------------>|                    |
    |                    |                   | RESERVE(RMD-QSPEC) |
    |                    |                   |------------------->|
    |                    |                   |                    |
    |                    |RESPONSE(RMD-QSPEC)|                    |
    |<------------------------------------------------------------|
    |                    |                   |                    |
   
   Figure 5: Basic operation of RMD specific refresh procedure

   Most of the non-default values of the objects contained in this 
   message MUST be used and/or set by the QNF ingress in the same 
   way as described in Section 4.4.2.1.  The following objects are 
   used and/or set differently:

Bader, et al.                                                 [Page 25]

INTERNET-DRAFT                                                 RMD-QOSM

   *  the flag "Acknowledge" (A) SHOULD be set "OFF"
   
   *  the PHR resource units MUST be included into the <Bandwidth> 
      parameter.   The value of the <Bandwidth> parameter depends on 
      how the different inter domain (end-to-end) flows are aggregated 
      by the QNF ingress node (e.g., the sum of all the PHR requested 
      resources of the aggregated flows).  If no flow aggregation is 
      accomplished by the QNF ingress node, then the value of the 
      <Bandwidth> parameter SHOULD be equal to the <Bandwidth> 
      parameter of its associated new (initial) intra-domain RESERVE 
      (RMD-QSPEC) message;
   
   *  the value of the <Control Type> parameter of the "PHR RMD 
      control information" field MUST be set to "2" (i.e., 
      PHR_Refresh_Update);

   *  In a single-domain case the "PDR RMD control information" field 
      MAY not be included into the message.

   *  the value of the <RII> object MUST contain the Response 
       Identification Information value of the ingress QNF, that is 
       unique within a session and different for each message (see 
       [QoS-NSLP]).  In general downstream nodes that desire 
   
   The intra-domain RESERVE (RMD-QSPEC) message is received and 
   processed by the QNF interior nodes.  Any QNF edge or QNF interior 
   node that receives a "PHR_Refresh_Update" control information field 
   MUST identify the traffic class state (PHB) (using the 
   <PHB-CLASS> parameter).  Most of the parameters in this refresh 
   intra-domain RESERVE (RMD-QSPEC) message MUST be used and/or set by 
   a QNF interior node in the same way as described in Section 4.4.2.1.

   The following objects are used and/or set differently:
   
   *  the value of <Bandwidth> parameter of the "RMD QoS descriptors" 
      field is used by the QNF interior node for refreshing the RMD 
      traffic class state. These resources (included in <Bandwidth>),
      if reserved, are added to the currently reserved resources
      per PHB and therefore they will become a part of the per traffic 
      class (per-PHB) reservation state.  If the refresh procedure 
      cannot be fulfilled then the <M> parameter of the "PHR RMD 
      control information" has to be set to "1".
   
   Any "PHR RMD control information" of type "PHR_Refresh_Update", and 
   its associated "RMD QoS descriptors" field (i.e., <Bandwidth>), 
   whether it is marked or not, is always processed, but marked bits 
   are not changed.

Bader, et al.                                                 [Page 26]

INTERNET-DRAFT                                                 RMD-QOSM

   The intra-domain RESERVE (RMD-QSPEC) message is received and 
   processed by the QNF egress node.  The "RMD QoS descriptors" and the 
   "PHR RMD control information" fields (and if available the "PDR RMD 
   control information") are read and processed by the RMD QoS 
   signaling model functionality.  The value of <Bandwidth> parameter 
   of the "RMD QoS descriptors" is used by the QNF egress node for 
   refreshing the RMD traffic class state.  If the refresh procedure 
   cannot be fulfilled then the <M> parameter of the "PHR RMD control 
   information" field has to be set to "1".
   
   A new intra-domain RESPONSE (PDR) message is generated by the 
   QNF egress node.  This message MUST include a "PDR RMD control 
   information" (of type PDR_Refresh_Report).
   
   This intra-domain RESPONSE (PDR) message MUST be sent to the QNF 
   ingress node, i.e., previous stateful hop.  This can, for example, 
   be accomplished by using the value of the <RII> included in the 
   received intra-domain RESERVE(RMD- QSPEC) message.  In general 
   downstream nodes that desire responses MAY keep track of this RII to 
   identify the RESPONSE when it passes back through them.  This <RII> 
   value MUST be included in the <RII> object of the generated 
   intra-domain RESPONSE (PDR) message.  The most of the non-default 
   values of the objects contained in this refresh intra-domain 
   RESPONSE (PDR) message MUST be set by a QNF egress node in the same 
   way as described in Section 4.4.2.1.   

   The following objects MUST be used and/or set differently:
   
   *  the value of the <RII> object is equal to the value of the RII 
      that is used by the QNF ingress to identify the RESPONSE when 
      it passes back through it.  This value was carried by the 
      intra-domain RESERVE (RMD-QSPEC) message in the <RII> object;
   
   *  the value of the <PDR Control Type> parameter of the "PDR RMD 
      control information" MUST be set to "5" (i.e., 
      PDR_Refresh_Report);
   
   *  the value of the <PDR M> field of the "PDR RMD control 
      information" MUST be equal to the value of the <M> parameter 
      of the "PHR RMD control information" that was carried by its 
      associated intra-domain RESERVE (RMD-QSPEC) message.
   
   *  the value of the <PDR BOUND_SESSION_ID> of the "PDR RMD 
      control information" field MUST be equal to the SESSION_ID 
      of the bounded intra-domain RMD session.
   
   When the intra-domain RESPONSE (PDR) message is received by 
   the QNF ingress node, then:
   
   *  the values of the <RII/RSN>, <ERROR_SPEC>, [ *QSPEC] objects 
      are processed by the standard QoS-NSLP protocol functions;

Bader, et al.                                                 [Page 27]

INTERNET-DRAFT                                                 RMD-QOSM

   *  the "PDR RMD control information" has to be processed and 
      removed by the RMD-QOSM functionality in the 
      QNF ingress node.  The RMD-QOSM functionality 
      is notified by reading the <PDR M> parameter of the "PDR RMD 
      control information" that the refresh procedure has been 
      successful or unsuccessful.  All session(s) (in case of the 
      flow aggregation procedure there will be more than one 
      sessions) associated with this RMD specific refresh session 
      MUST be informed about the success or failure of the refresh 
      procedure.  In case of failure, the QNF ingress node has to 
      generate (in a standard QoS-NSLP way) an error end-to-end 
      RESPONSE message that will be sent towards QNI.
   

4.4.2.4.  RMD modification of reservation
   
   When the RMD QoS model functionality of the QNF ingress node 
   receives an end-to-end RESERVE message that is requesting a 
   modification on the number of reserved resources then the following 
   procedure is applied.  When the modification request requires an 
   increase on the number of reserved resources, then the RMD QoS 
   model functionality of the ingress node MUST add the old and 
   already reserved number of resources from the number of resources 
   included in the new modification request.  The result of this 
   subtraction MUST be introduced within the <Bandwidth> parameter of 
   the "RMD QoS descriptors" field, which is sent together with a 
   "PHR_Resource_Request" control information field.  If a QNF edge or 
   QNF interior node is not able to reserve the number of requested 
   resources, then the "PHR_Resource_Request" control information field 
   that is associated with the <Bandwidth> parameter MUST be marked.  
   In this situation the RMD specific operation for a unsuccessful 
   reservation functionality will be applied (see Section 4.4.2.2).
   
   When the modification request requires a decrease on the number of 
   reserved resources, then the QNF ingress node will have to subtract 
   the number of resources included in the new modification request 
   from the old and already reserved number of resources.  The result 
   of this subtraction MUST be introduced in the <Bandwidth> 
   parameter of the "RMD QoS descriptors" field, which is sent together 
   with a PHR_Release_Request control information field.  Subsequently 
   a RMD release procedure SHOULD be accomplished (see Section 4.4.2.5).
   

4.4.2.5  RMD release procedure
   
   If a refresh RESERVE message does not arrive at a QNF interior node 
   within the refresh time-out period then the resources associated 
   with this message are removed.
   
   This soft state behavior provides certain robustness for the system 
   ensuring that unused resources are not reserved for long time.  
   Resources can be removed by explicit release procedure at any time. 

Bader, et al.                                                 [Page 28]

INTERNET-DRAFT                                                  RMD-QOSM
   
   When the RMD-RMF of a QNF edge or QNF interior node processes a 
   "PHR_Release_Request" control information field it MUST identify the 
   value of the <PHB-CLASS> parameter included in the "RMD QoS 
   descriptors" field, and estimate the refresh period where it last 
   signaled the resource usage (where it last processed a 
   "PHR_Refresh_Update" control information field). This MAY be done 
   by, for example, giving the opportunity to a QNF ingress node to 
   calculate the time lag, say "T_lag", between the last sent 
   "PHR_Refresh_Update" control information field and the 
   "PHR_Release_Request" control information field.  The value of this 
   time lag "T_Lag", is first normalized to the length of the refresh 
   period, say "T_period".  In other words, the ratio between this time 
 
   lag, "T_Lag", and the length of the refresh period, "T_period", is 
   calculated.  This ratio is then introduced into the <Time Lag> 
   parameter of the "PHR_Release_Request" control information field.  
   When a node (QNF edge or QNF interior) receives this 
   "PHR_Release_Request" control information, it MUST store its arrival 
   time.  Then it MUST calculate the time difference, say "Tdiff", 
   between this arrival time and the start of the current refresh 
   period, "T_period".  Furthermore, this node MUST derive the value of 
   the time lag "T_Lag", from the <Time Lag> parameter.
   
   This can be found by multiplying the value included in the <Time 
   Lag> parameter with the length of the refresh period, "T_period".  
   If the derived time lag, "T_lag", is smaller than the calculated 
   time difference, "T_diff", then this node MUST decrease the PHB 
   reservation state with the number of resource units indicated in the 
   <Bandwidth> parameter of the "RMD QoS descriptors" field that has 
   been sent together with the "PHR_Release_Request" control 
   information field, but not below zero.
   
   An RMD specific release procedure can be triggered by an end-to-end 
   RESERVE with a TEAR flag set ON (see Section 4.4.2.5.1) or it can be 
   triggered by either a RESPONSE or NOTIFY message that includes a 
   marked (i.e., <PDR M> and/or <PDR S> parameters are set ON) 
   "PDR_Reservation_Report" control information field (see Section 
   4.2.2.2) or "PDR_Congestion_Report" control information field (see 
   Section 4.4.2.6).


4.4.2.5.1.  Triggered by a RESERVE message
   
   This RMD explicit release procedure can be triggered by a tear (TEAR 
   flag set ON) end-to-end RESERVE message.  When a tear (TEAR flag 
   set ON) end-to-end RESERVE message arrives to the QNF ingress 
   then the QNF ingress node SHOULD process the message in a standard 
   QoS-NSLP way (see [QoS-NSLP]).  In addition to this, the RMD QoS 
   signaling model functionality MUST be notified.  It will generate an 
   intra-domain RESERVE (RMD-QSPEC) message.  Before generating this 

Bader, et al.                                                 [Page 29]

INTERNET-DRAFT                                                 RMD-QOSM

   message, the RMD QoS model functionality is using the RMD traffic 
   class (PHR) resources (specified in <Bandwidth>) and the PHB type 
   (specified in <PHB-CLASS>) for a RMD release procedure.  This can 
   be achieved by subtracting the amount of the requested resources 
   from the total reserved amount of resources stored in the RMD 
   traffic class state.

   This intra-domain RESERVE (RMD-QSPEC) message MUST include a "RMD 
   QoS descriptors" field and a "PHR RMD control information" field, 
   (i.e., "PHR_Resource_Release") and it MAY include a "PDR RMD control 
   information" field, (i.e., PDR_Release_Request).  An example of this 
   operation can be seen in Figure 6.
   
QNF (ingress)     QNF (interior)       QNF (interior)    QNF (egress)
NTLP stateful    NTLP stateless        NTLP stateless    NTLP stateful
    |                    |                   |                    |
RESERVE                  |                   |                    |
--->|                    |                   |     RESERVE        |
    |------------------------------------------------------------>|
    |RESERVE(RMD-QSPEC:Tear=1)               |                    |
    |------------------->|                   |                    |
    |                    |RESERVE(RMD-QSPEC:Tear=1)               |
    |                    |------------------->|                   |
    |                    |                 RESERVE(RMD-QSPEC:Tear=1)
    |                    |                   |------------------->|
    |                    |                   |                RESERVE
    |                    |                   |                    |-->
    |                    |                   |
   
   Figure 6: Explicit release triggered by RESERVE used by the RMD-QOSM

   The most of the non default values of the objects contained in the 
   tear intra-domain RESERVE message are set by the QNF ingress node in 
   the same way as described in Section 4.4.2.1.  The following objects 
   are set differently:

   *  the flag "Acknowledge" (A) SHOULD be set "OFF"
   
   *  The <RII> object is not included in this message.  This is 
      because the QNF ingress node does not need to receive a 
      response from the QNF egress node;
   
   *  the TEAR flag is set to ON;
   
   *  the PHR resource units MUST be included into the <Bandwidth> 
      parameter of the "RMD QoS descriptors" field;
   
   *  the value of the <NSLP Hops> parameter has to be set to one.  

Bader, et al.                                                 [Page 30]

INTERNET-DRAFT                                                 RMD-QOSM
   
   *  the value of the <Time Lag> parameter of the "PHR RMD control 
      information" is calculated by the RMD-QOSM 
      functionality (see introductory part of Section 4.4.2.5)
      the value of the <Control Type> parameter of "PHR RMD control 
      information" is set to "3" (i.e., PHR_Resource_Release)

   The intra-domain tear RESERVE (RMD-QSPEC) message is received and 
   processed by the QNF interior nodes.  The most of the non-default 
   values of the objects contained in this refresh intra-domain RESERVE 
   (RMD-QSPEC) message are set by a QNF interior node in the same way 
   as described in Section 4.4.2.1.  The following objects are set and 
   processed differently:

   *  Any QNF interior node that receives the combination of the "RMD 
   QoS descriptors" field and the "PHR_Resource_Release" control 
   information field, it MUST identify the traffic class state (PHB) 
   (specified in <PHB-CLASS>) and release the requested resources 
   included in the <Bandwidth> parameter.  This can be achieved by 
   subtracting the amount of RMD traffic class requested resources, 
   included in the <Bandwidth> parameter, from the total reserved 
   amount of resources stored in the RMD traffic class state.  The 
   value of the <Time Lag> parameter of the "PHR_Resource_Release" 
   control information field is used during the release procedure as 
   explained in the introductory part of Section 4.4.2.5
   
   The intra-domain tear RESERVE (RMD-QSPEC) message is received and 
   processed by the QNF egress node.  The "RMD QoS descriptors" and the 
   "PHR RMD control field" (and if available the "PDR RMD control 
   information" field) are read and processed by the RMD QoS signaling 
   model functionality.  The value of the <Bandwidth> parameter of the 
   "RMD QoS descriptors" field and the value of the <Time Lag> field 
   of the "PHR RMD QoS control information" field MUST be used by the 
   RMD release procedure.  This can be achieved by subtracting the 
   amount of RMD traffic class requested resources, included in the 
   <Bandwidth> parameter, from the total reserved amount of resources 
   stored in the RMD traffic class state.
   
   The end-to-end RESERVE message is forwarded by the next hop (i.e., 
   QNF egress) only if the intra-domain tear RESERVE (RMD-QSPEC) 
   message arrives at the QNF egress node.  The QoS-NSLP-E2E-IGNORE 
   feature of NTLP/GIMPS MUST be deactivated.
   
   
4.4.2.5.2   Triggered by a marked RESPONSE or NOTIFY message
   
   This RMD explicit release procedure can be triggered by either an 
   end-to-end RESPONSE (PDR) message with a <PDR M> marked "PDR RMD 
   control information" field (see Section 4.4.2.2) or an intra-domain 
   NOTIFY (PDR) message (see Section 4.4.2.6) with a <M> or <S> marked 
   "PDR RMD control information" field.  This RMD specific release 
   procedure can be terminated at any QNF edge or any QNF interior 
   node.  This is determined using the <Max_NSLP Hops> field.  node.  

Bader, et al.                                                 [Page 31]

INTERNET-DRAFT                                                 RMD-QOSM

   The RMD specific explicit release procedure that is 
   terminated at a QNF interior (or QNF edge) node is denoted as RMD 
   specific partial release procedure.  This explicit release procedure 
   can be, for example, used during a RMD specific operation for 
   unsuccessful reservation (see Section 4.4.2.2) or severe congestion 
   (see Section 4.4.2.6).  When the RMD QoS signaling model 

   functionality of a QNF ingress node receives a <M> or <S> marked 
   "PDR RMD control information" field of type "PDR_Reservation_Report"
   or "PDR_Congestion_Report", it MUST start an RMD partial release 
   procedure.  The QNF ingress node generates an intra-domain RESERVE 
   (RMD-QSPEC) message.  Before generating this message, the RMD-QOSM 
   functionality is using the RMD traffic class (PHR) resource units 
   for a RMD release procedure.  This can be achieved by subtracting 
   the amount of RMD traffic class requested resources from the total 
   reserved amount of resources stored in the RMD traffic class state.
   
   When the generation of the intra-domain RESERVE (RMD-QSPEC) message 
   is triggered by an intra-domain NOTIFY (PDR) message then the 
   intra-domain RESERVE (RMD-QSPEC) message MUST include a 
   <RMD QoS descriptors> field and a <PHR RMD control information> 
   field, (i.e., PHR_Resource_Release) and a "PDR RMD control 
   information field", (i.e., PDR_Release_Request).  An example of this 
   message exchange can be seen in Figure 7.
   
QNF (ingress)     QNF (interior)         QNF (interior)    QNF (egress)
NTLP stateful    NTLP stateless         NTLP stateless    NTLP stateful
    |                  |                  |                  |
    |                  |                  |                  |
    | NOTIFY (PDR)     |                  |                  |
    |<-------------------------------------------------------|
    |RESERVE(RMD-QSPEC:Tear=1,M=1,S=SET)  |                  |
    | ---------------->|RESERVE(RMD-QSPEC:Tear=1, M=1,S=SET) |
    |                  |                  |                  |
    |                  |----------------->|                  |
    |                  |           RESERVE(RMD-QSPEC:Tear=1, M=1,S=SET)
    |                  |                  |----------------->|
   
   Figure 7: Basic operation during RMD explicit release procedure 
   triggered by NOTIFY used by the RMD-QOSM
   
   When the generation of the intra-domain RESERVE (RMD-QSPEC) message 
   is triggered by an end-to-end RESPONSE (PDR) message then this 
   generated intra-domain RESERVE (RMD-QSPEC) message MUST include a 
   <RMD QoS descriptors> field and a "PDR RMD control 
   information field",  
   field, (i.e., PHR_Resource_Release) and a "PDR RMD control 
   information field", (i.e., PDR_Release_Request).  An example of 
   this operation can be seen in Figure 8.

Bader, et al.                                                 [Page 32]

INTERNET-DRAFT                                                 RMD-QOSM
   
   The most of the non-default values of the objects contained in the 
   tear intra-domain RESERVE (RMD-QSPEC) message are set by the QNF 
   ingress node in the same way as described in Section 4.4.2.1.
   
   The following objects MUST be used and/or set differently:
   
   *  The value of the <M> parameter of the "PHR RMD control 
      information" MUST be set to "1".

   *  When the tear intra-domain RESERVE message is triggered by a 
      NOTIFY message, then the value of the <S> parameter of the 
     "PHR RMD control information" field MUST be set to "1".  The 
      RESERVE message SHOULD include "PDR RMD control information".

   *  When the tear intra-domain RESERVE message is triggered by a 
      RESPONSE (PDR) message, then the value of the <Max NSLP Hops> 
      parameter of the "PDR RMD control information" field included in 
      the received <M> marked intra-domain RESPONSE (PDR) message MUST 
      be included in the <Max NSLP Hops> parameter of the "PDR RMD 
      control information" field of the RESERVE message.  The value of 
      the EP-Type parameter of the PDR message SHOULD be equal to the 
      QoS-NSLP protocol ID.
   
   *  When the generation of the intra-domain RESERVE (RMD-QSPEC) 
      message is triggered by a NOTIFY (PDR) message then this 
      generated intra-domain RESERVE (RMD- QSPEC) message SHOULD not 
      include a "PDR RMD control information" field.  
   
QNF (ingress)     QNF (interior)        QNF (interior)    QNF (egress)
                                     Node that marked
                                    PHR_Resource_Request
                                       <PHR> object
NTLP stateful    NTLP stateless        NTLP stateless    NTLP stateful
    |                    |                   |                    |
    |                    |                   |                    |
    | RESPONSE (RMD-QSPEC: M=1)              |                    |
    |<------------------------------------------------------------|
    |RESERVE(RMD-QSPEC: Tear=1, M=1, <NSLP Hops>=<Max_NSLP Hops>)|
    |------------------->|                   |                    |
    |                    |                   |                    |
   
   Figure 8: Basic operation during RMD explicit release procedure 
   Triggered by RESPONSE used by the RMD-QOSM
   
   Any QNF edge or QNF interior node that receives a combination of the 
   "RMD QoS descriptors" field and the "PHR_Resource_Release" control 
   information field it MUST identify the traffic class state (PHB), 
   using the <PHB-CLASS> parameter> and release the requested 
   resources included in the <Bandwidth> field.  This can be achieved 
   by subtracting the amount of RMD traffic class requested resources, 
   included in the <Bandwidth> field, from the total reserved amount of 

Bader, et al.                                                 [Page 33]

INTERNET-DRAFT                                                 RMD-QOSM

   resources stored in the RMD traffic class state.  The value of the 
   <Time Lag> parameter of the "PHR RMD control information" field is 
   used during the release procedure as explained in the introductory 
   part of Section 4.4.2.5. Furthermore, the <NSLP Hops> value included 
   in the "PHR RMD control information" field is increased by one.  If 
   the value of <M> parameter of the "PHR_Resource_Release" control 
   information field is "1" and if the value of the <S> parameter is 
   set to "0" then the <Max_NSLP Hops> value included in the "PDR RMD 
   control information" field MUST be compared with the calculated
   <NSLP Hops> value.  When these two values are equal then the 

   intra-domain RESERVE(RMD-QSPEC) has to be terminated and it will not 
   be forwarded downstream.  The reason of this is that the QNF node 
   that is currently processing this message was the last QNF node that 
   successfully processed the "RMD QoS descriptors" and "PHR RMD 
   control information" fields of its associated initial reservation 
   request (i.e., initial intra-domain RESERVE (RMD-QSPEC) message).  
   Its next QNF downstream node was unable to successfully process the 
   initial reservation request, and therefore this QNF node marked the 
   <M> parameter of the "PHR_Resource_Request" control information 
   field.  When the values of the <M> and <S> parameters are set to 
   "0", then this message will not be terminated by a QNF interior 
   node, but it will be forwarded in the downstream direction.  The QNF 
   egress node will receive and process the PHR_Resource_Release 
   control information field.  Afterwards, the QNF egress node MUST 
   terminate the intra-domain RESERVE (RMD-QSPEC) object.
   

4.4.2.6. Severe congestion handling

   This section describes the operation of the RMD-QOSM when a severe 
   congestion occurs within the Diffserv domain.  When a failure in a 
   communication path, e.g., router failure or link failure, occurs the 
   routing algorithms will adapt to failures by changing the routing 
   decisions to reflect changes in the topology and traffic volume. As 
   a result the re-routed traffic will follow a new path, which may 
   result in overloaded nodes as they need to support more traffic than 
   their capacity allows. This may cause a severe congestion occurrence 
   in the communication path. 

   The QoS-NSLP and RMD are able to cope with congested situations 
   using the refresh procedure, see Section 4.4.2.3. If the refresh is 
   not successful in an QNF interior node, edge nodes are notified by 
   "S" marking the refresh messages and by including the percentage of 
   overload into the < Overload %> RMD parameter. The flows that cannot 
   be supported, i.e., based on the value included in the < Overload %> 
   parameter, are terminated. In general, relying the soft state 
   refresh mechanism solves the congestion within the time frame of the 
   refresh period. If this mechanism is not fast enough additional 
   functions have be used, which are described below.    

Bader, et al.                                                 [Page 34]

INTERNET-DRAFT                                                 RMD-QOSM

4.4.2.6.1 Explicit congestion notification

   Explicit congestion notification (ECN) described in RFC 3168 might 
   be used to complement RMD basic functions. Congestion notification 
   can be based on queue management, e.g. RED.  ECN congestion 
   notification will be discussed in IETF62 and may be considered in 
   the next version of the draft.


4.4.2.6.2 Severe congestion using proportional data packet marking
   
   Typically, routing algorithms are able to adapt and change their 
   routing decisions to reflect changes in the topology (e.g., link 
   failures) and traffic volume.  In such situations, the re-routed 
   traffic follows a new path.  Nodes located on this new path MAY 
   become overloaded after rerouting.  Moreover, when a link fails, 
   the traffic passing through might be dropped, degrading its 
  performance.

   When a severe congestion occurs, the re-routed traffic follows a 
   new path. In this situation the available resources, may not be 
   enough to meet the required QoS for all the flows along the new 
   path.  Therefore, one or more flows SHOULD be terminated.  Interior 
   nodes notify edge nodes by data marking (proportional marking) or 
   marking the refresh messages using the <S> and < Overload %> 
   parameters.  In this version of this draft the severe congestion 
   handling that uses the proportional data marking is explained.  

   The QNF Interior node detecting severe congestion marks data packets 
   passing of the node in which the severe congestion was detected.  
   For severe congestion marking of the data packet, two code-points 
   SHOULD be allocated for each traffic class.  One is used to indicate 
   that the packet is passed a congested node.  The other code-point 
   can be used to indicate the degree of congestion.  This can be done 
   for example using the proportional marking method, which means that 
   the marked bytes are proportional to the degree of congestion.  The 
   QNF egress node applies a predefined policy to solve the severe 
   congestion, by selecting a number of inter domain (end-to-end) 
   flows that SHOULD be terminated.  For these flows (sessions), the 
   QNF egress node generates and sends a NOTIFY(PDR) message to the 
   QNF ingress node (its upstream stateful QoS-NSLP peer) to indicate 
   the severe congestion in the communication path.  This message MUST 
   include a "PDR RMD control information" field 
  ("PDR_Reservation_Report").  The value of the <PDR BOUND_SESSION_ID> 
   parameter of the "PDR_Reservation_Report" control information field 
   MUST be the same as the SESSION_ID of the flow that has to be 
   terminated.  Note that this message SHOULD use a NTLP/GIMPS 
   connection mode.   

   The non-default values of the objects contained in the NOTIFY(PDR) 
   message MUST be set by the QNF egress node as follows:

Bader, et al.                                                 [Page 35]

INTERNET-DRAFT                                                 RMD-QOSM
   
   *  the values of the <ERROR_SPEC> object is set by the standard 
      QoS-NSLP protocol functions.
   
   *  the value of the <PDR Control Type> parameter of the "PDR RMD 
      control information" field object SHOULD be set to "8" (i.e., 
      PDR_Congestion_Report).
   
   *  The value of the <PDR M> parameter of the "PDR RMD control 
      information" field MUST be set to "1".

   *  The value of the <PDR S> parameter of the "PDR RMD control 
      information" field MUST be set to "SET".
   
   *  the value of the <PDR BOUND_SESSION_ID> parameter of the 
      "PDR_Reservation_Report" control information field MUST be the 
      same as the SESSION_ID of the flow that has to be terminated.  

   *  the value of the EP-Type field of the "PDR RMD control 
      information" field MUST  be the QoS-NSLP protocol ID.
   
   Upon receiving this message, the QNF ingress node resolves the 
   severe congestion by a predefined policy, e.g., refusing new 
   incoming flows (sessions), terminating the affected and notified 
   flows (sessions), or shifted to an alternative RMD traffic class 
   (PHB).  An example of such an operation is depicted in Figure 9.
   
 QNF (ingress)    QNF (interior)        QNF (interior)    QNF (egress)
  user  |                  |                 |                  |
  data  |  user data       |                 |                  |
 ------>|----------------->|     user data   | user data        |
        |                  |---------------->S(# marked bytes)  |
        |                  |                 S----------------->|
        |                  |                 S(# unmarked bytes)|
        |                  |                 S----------------->|Term.
        |                 NOTIFY(PDR)                           |flow?
        |<----------------|------------------|------------------|YES
        |RESERVE(RMD-QSPEC:Tear=1,M=1,S=SET) |                  |
        | --------------->|RESERVE(RMD-QSPEC:T=1, M=1,S=SET)    |
        |                 |                  |                  |
        |                 |----------------->|                  |
        |                 |       RESERVE(RMD-QSPEC:Tear=1, M=1,S=SET)
        |                 |                  |----------------->|
   
   Figure: 9  RMD severe congestion handling
   
   The severe congestion notification function of RMD can be used for 
   implementing a simple feedback-based admission control within a 
   Diffserv domain.  In one or a few nodes along the data thresholds 
   are set in the resource management function for the data traffic 
   belonging to different PHBs. If the threshold is exceeded the data 

Bader, et al.                                                  [Page 36]

INTERNET-DRAFT                                                  RMD-QOSM

   packets are marked in the DSCP field to indicate the high load of 
   different PHBs. In this case the egress node sends a NOTIFY(PDR) 
   message to the ingress node, which MAY block the incoming traffic 
   belonging to the same PHB until the traffic volume decreases below 
   the threshold, or forwards it in a lower priority queue. 

4.4.3.  Bi-directional operation
   
   RMD assumes asymmetric routing by default.  Combined sender-receiver 
   initiated reservation cannot be done in the RMD domain because 
   upstream NTLP states are not stored in interior routers.  Therefore 
   the bi-directional operation SHOULD be performed by two sender-
   initiated reservations (sender&sender).  We assume that the QNF edge 
   nodes are common for both upstream and downstream directions, 
   therefore, the two reservations/sessions can be bound at the QNF 
   edge nodes.
   
   This bi-directional sender&sender procedure can then be applied 
   between the QNF edges (QNF ingress and QNF egress) nodes of the RMD 
   QoS signaling model.  In the situation that a security association 
   exists between the QNF ingress and QNF egress nodes (see Figure 10), 
   and the QNF ingress node has the required <Bandwidth> parameters 
   for both directions, i.e., QNF ingress towards QNF egress and QNF 
   egress towards QNF ingress, then the QNF ingress MAY include both 
   <Bandwidth> parameters (needed for both directions) into the 
   RMD-QSPEC within a RESERVE message.  In this way the QNF egress node 
   is able to use the QoS parameters needed for the "egress towards 
   ingress" direction (QoS-2).  The QNF egress is then able to create a 
   RESERVE with the right QoS parameters included in the QSPEC, i.e., 
   RESERVE (QoS-2).Both directions of the flows are bound by inserting 
   the <BOUND_SESSION_ID> object at the QNF ingress and QNF egress.
    
     |------ RESERVE (QoS-1, QoS-2)----|
     |                                 V
     |           Interior/stateless QNEs                  
                 +---+     +---+     
        |------->|QNE|-----|QNE|------
        |        +---+     +---+     |
        |                            V
      +---+                        +---+
      |QNE|                        |QNE| 
      +---+                        +---+
         ^                           |
      |  |       +---+     +---+     V
      |  |-------|QNE|-----|QNE|-----|
      |          +---+     +---+     
   Ingress/                         Egress/
   statefull QNE                    statefull QNE
                                     |
   <--------- RESERVE (QoS-2) -------|
   
   Figure 10: The bi-directional reservation scenario in the RMD domain

Bader, et al.                                                 [Page 37]

INTERNET-DRAFT                                                 RMD-QOSM
   
   A bidirectional reservation, within the RMD domain, is indicated by 
   the <B> and <PDR B> flags, which are set in all messages.  Upstream 
   end-to-end messages include the session ID of downstream messages 
   using BOUND_SESSION_ID and vice versa.  

   In the situation that no security association exists between 
   the QNF ingress and QNF egress nodes the Bi-directional reservation 
   for the sender&sender scenario in the RMD domain SHOULD use the 
   scenario specified in [QoS-NSLP] as ôBi-directional reservation for 
   sender&sender scenarioö.
   
   Note that in the following sections it is considered that the QNF 
   edge nodes are common for both upstream and downstream directions 
   and therefore, the two reservations/sessions can be bounded at the 
   QNF edge nodes.  Furthermore, it is considered that a security 
   association exists between the QNF ingress and QNF egress nodes, 
   and the QNF ingress node has the required <Bandwidth> parameters 
   for both directions, i.e., QNF ingress towards QNF egress and 
   QNF egress towards QNF ingress.
   
   
4.4.3.1 Successful and unsuccessful reservations 
   
   This section describes the operation of the RMD-QOSM where a RMD 
   bi-directional reservation operation is either successfully or 
   unsuccessfully accomplished.  
   
   The bi-directional successful reservation is similar to a 
   combination of two unidirectional successful reservations that are 
   accomplished in opposite directions, see Figure 11. The main 
   differences of the bi-directional successful reservation procedure 

   with the combination of two unidirectional successful reservations 
   accomplished in opposite directions are as follows.  The intra-
   domain RESERVE message sent by the QNF ingress node towards the QNF 
   egress node, is denoted in Figure 11 as RESERVE (RMD-QSPEC): 
   "forward".  The main differences between the RESERVE (RMD-QSPEC): 
   "forward" message used for the bi-directional successful reservation 
   procedure and a RESERVE (RMD-QSPEC message used for the 
   unidirectional successful reservation are as follows:  
   
   *  the <B> bit of the "PHR RMD control information" field indicates 
      a bi-directional reservation and is set to "1".
   
   *  the "PDR RMD control information" field is included into the 
      RESERVE(RMD-QSPEC): "forward" message.  The value of the PDR 
      <PDR Control Type> is "1", i.e., "PDR_Reservation_Request".
   
   *  the <PDR B> bit indicates a bi-directional reservation and is set 
      to "1".
   
Bader, et al.                                                 [Page 38]

INTERNET-DRAFT                                                 RMD-QOSM
   
   *  the <PDR Reverse Requested Resources> field specifies the 
      requested bandwidth that has to be used by the QNF egress node to 
      initiate another intra-domain RESERVE message in the reverse 
      direction.  

   *  the response "PDR RMD control information" field sent by a QNF 
      egress to a QNF ingress node is not carried by a RESPONSE 
      message, but it is carried by a RESERVE message that is sent by 
      the QNF egress node towards the QNF ingress node (denoted in 
      Figure 11 as RESERVE (RMD-QSPEC): "reverse").
   
QNF (ingress)   QNF (int.)    QNF (int.)    QNF (int.)   QNF (egress)
NTLP stateful  NTLP st.less  NTLP st.less  NTLP st.less  NTLP stateful
    |                |               |               |              |
    |                |               |               |              |
    |RESERVE(RMD-QSPEC)              |               |              |
    |"forward"       |               |               |              |
    |                |    RESERVE(RMD-QSPEC):        |              |
    |--------------->|    "forward"  |               |              |
    |                |------------------------------>|              |
    |                |               |               |------------->|
    |                |               |               |              |
    |                |               |RESERVE(RMD-QSPEC)            |
    |      Reserve(RMD-QSPEC)        | "reverse"     |<-------------|
    |      "reverse"   |             |<--------------|              |
    |<-------------------------------|               |              |
   
      Figure 11: Intra-domain signaling operation for successful 
                 bi-directional reservation

   The RESERVE (RMD-QSPEC): "reverse" message is initiated by the QNF 
   egress node at the moment that the RESERVE (RMD-QSPEC): "forward" 
   message is successfully processed by the QNF egress node.  The main 
   differences between the RESERVE (RMD-QSPEC): "reverse" message used 
   for the bi-directional successful reservation procedure and a 
   RESERVE (RMD-QSPEC) message used for the unidirectional successful 
   reservation are as follows:
   
   *  the value of the <Bandwidth> field is set equal to the value of 
      the <PDR Reverse Requested Resources> field included in the 
      RESERVE (RMD-QSPEC): "forward" message that triggered the 
      generation of this RESERVE (RMD-QSPEC): "reverse" message
   
   *  the <B> bit of the "PHR RMD control information" field 
      indicates a bi-directional reservation and is set to "1"
   
   *  the "PDR RMD control information" field is included into the 
      RESERVE(RMD-QSPEC): "reverse" message.  The value of the PDR 
      <PDR Control Type> is "4", i.e., "PDR_Reservation_Report"
   
   *  the <PDR B> bit indicates a bi-directional reservation and is 
      set to "1"

Bader, et al.                                                 [Page 39]

INTERNET-DRAFT                                                 RMD-QOSM

   *  the value of the <PDR BOUND_SESSION_ID> field is set equal to 
      the SESSION_ID of the intra domain session associated with the 
      RESERVE (RMD-QSPEC): "forward" message that triggered the 
      generation of this RESERVE (RMD-QSPEC): "reverse" message.

   Figure 12 and Figure 13 show the flow diagrams used in case of a 
   unsuccessful bi-directional reservation.  In the former figure it 
   is considered that the QNF that is not able to support the 
   requested <Bandwidth> is located in the direction QNF ingress 
   towards QNF egress.  In the latter figure it is considered that the 
   QNF that is not able to support the requested <Bandwidth> is 
   located in the direction QNF egress towards QNF ingress.
   
   The main differences between the bi-directional unsuccessful 
   procedure shown in Figure 12 and the bi-directional successful 
   procedure are as follows:
   
   *  the QNF node that is not able to reserve resources for a 
      certain request is located in the "forward" path, i.e., path 
      from QNF ingress towards the QNF egress.
   
   *  the QNF node that is not able to support the requested 
      <Bandwidth> it MUST mark the <M> bit, i.e., set to value "1", of 
      the RESERVE(RMD-QSPEC): "forward".
   
   *  the operation for this type of unsuccessful bi-directional 
      reservation is similar to the operation for unsuccessful uni-
      directional reservation shown in Figure 4.  The main difference 
      is that the QNF egress generates an intra-domain (local) 
      RESPONSE(PDR) message that is sent towards QNF ingress node.

QNF(ingress)   QNF (int.)    QNF (int.)    QNF (int.)    QNF (egress)
NTLP stateful  NTLP st.less  NTLP st.less  NTLP st.less  NTLP stateful
    |                |             |              |               |
    |RESERVE(RMD-QSPEC):           |              |               |
    |  "forward"     |  RESERVE(RMD-QSPEC):       |               |
    |--------------->|  "forward"  |              M RESERVE(RMD-QSPEC):
    |                |--------------------------->M  "forward-M marked"
    |                |             |              M-------------->|
    |                |           RESPONSE(PDR)    M               |
    |                |        "forward - M marked"M               |
    |<------------------------------------------------------------|
    |RESERVE(RMD-QSPEC)            |              M               |
    |"forward - T tear"            |              M               |
    |---------------->             |              M               |
   
Figure 12: Intra-domain signaling operation for unsuccessful 
           bi-directional reservation (rejection on path QNF(ingress)
           towards QNF(egress))

Bader, et al.                                                 [Page 40]

INTERNET-DRAFT                                                 RMD-QOSM
   
   The main differences between the bi-directional unsuccessful 
   procedure shown in Figure 13 and the in bi-directional successful 
   procedure are as follows:

   *  the QNF node that is not able to reserve resources for a 
      certain request is located in the "reverse" path, i.e., path 
      from QNF egress towards the QNF ingress.

   *  the QNF node that is not able to support the requested 
      <Bandwidth> it MUST mark the <M> bit, i.e., set to value "1", 
      the RESERVE(RMD-QSPEC): "reverse".
   
   *  the QNF ingress uses the information contained in the received 
      "PHR RMD control information" and "PDR RMD control 
      information" fields of the RESERVE (RMD-QSPEC): "reverse" and 
      generates a tear intra-domain (local) RESERVE(RMD-QSPEC): 
      "forward - T tear" message.  This message carriers a 
      "PHR_Release_Request" and a "PDR_Release_Request" control 
      information fields.  This message is sent towards QNF egress 
      node.  The QNF egress node by using the information contained 
      in the "PHR_Release_Request" and the "PDR_Release_Request" 
      control information fields it generates a RESERVE(RMD-QSPEC): 
      "reverse - T tear" message that is sent towards the QNF 
      ingress node.

QNF (ingress)    QNF (int.)    QNF (int.)    QNF (int.)    QNF (egress)
NTLP stateful   NTLP st.less  NTLP st.less  NTLP st.less   NTLP stateful
    |                |                |                |              |
    |RESERVE(RMD-QSPEC)               |                |              |
    |"forward"       |  RESERVE(RMD-QSPEC):            |              |
    |--------------->|  "forward"     |           RESERVE(RMD-QSPEC): |
    |                |-------------------------------->|"forward"     |
    |                |   RESERVE(RMD-QSPEC):           |------------->|
    |                |    "reverse"   |                |              |
    |                |              RESERVE(RMD-QSPEC) |              |
    |    RESERVE(RMD-QSPEC):          M      "reverse" |<-------------|
    |   "reverse - M marked"          M<---------------|              |
    |<--------------------------------M                |              |
    |                |                M                |              |
    |RESERVE(RMD-QSPEC):              M                |              |
    |"forward - T tear"               M                |              |
    |--------------->|  RESERVE(RMD-QSPEC):            |              |
    |                |  "forward - T tear"             |              |
    |                |-------------------------------->|              |
    |                |                M                |------------->|
    |                |                M             RESERVE(RMD-QSPEC):
    |                |                M             reverse - T tear" |
    |                |                M                |<-------------|

   Figure 13: Intra-domain signaling normal operation for unsuccessful 
             bi-directional reservation (rejection on path QNF(egress)
             towards QNF(ingress))

Bader, et al.                                                 [Page 41]

INTERNET-DRAFT                                                 RMD-QOSM
   
   More details on the operation of the bi-directional reservation 
   operation will be provided in future versions of this draft.

4.5 Handling of additional errors

   During the QSpec processing, additional errors may occur. The way 
   of how these additional errors are handled and notified is specified 
   in [QSP-T].

   
5.  Security Consideration
   
   The RMD QSP aims to be very lightweight signaling with regard to the 
   number of signaling message roundtrips and the amount of state 
   established at involved signaling nodes with and without reduced 
   state on QNEs. This implies the usage of the Datagram Mode which 
   cannot benefit from security protection. As such, RMD signaling is 
   target towards intra-domain signaling only. Still it is possible 
   to provide some degree of security.

   A router implementing a QoS signaling protocol can, similar to a 
   router without QoS signaling, do a lot of harm to a system. A router 
   can delay, drop, inject, duplicate or modify packets. A certain 
   degree of trust is, therefore, always assumed in most systems.

   In the context of RMD QSP signaling a classification between in-path 
   adversaries and off-path adversaries needs to be made. Furthermore, 
   it might be necessary to differentiate between always off-path nodes 
   and nodes which are only off-path with regard to a specific 
   signaling message.

   The following paragraph aims to raise a discussion about the 
   requirements placed on the security properties of the signaling 
   message exchange:

   First, it is necessary to protect the message communication between 
   the QNF ingress and the QNF egress. This is possible since these 
   nodes are meant to be stateful nodes and do not suffer from the same 
   constraints as network QNF interior nodes. This mechanism already 
   ensures that intermediate or off-path nodes initiate some signaling 
   messages towards the edges. An adversary is therefore unable to 
   inject an NOTIFY message or a RESERVE message. Additionally, such a 
   security protection ensures that only selected fields can be 
   modified. To accomplish this type of protection two mechanisms need 
   to be considered that both require enhancements to the QoS NSLP. 
   Since the intra-domain RESERVE message travels along several 
   stateless nodes it is necessary to provide a protection at the 
   QoS-NSLP. Channel security at the GIMPS layer might in most cases 
   not be possible due to the nature of the NTLP datagram mode message. 
   One option is the usage of the Cryptographic Message Syntax (CMS) to 
   protect selected payloads at the QoS NSLP layer. A digital signature 
   is suitable if the QNF ingress and the QNF egress node do not need 

Bader, et al.                                                 [Page 42]

INTERNET-DRAFT                                                 RMD-QOSM

   to share a secret nor do they require an in-band exchange of 
   certificates due to the closed environment where a pre-distribution 
   of certificates can be assumed. Such a digital signature would 
   amount for about roughly 600 to 700 bytes of payloads within a 
   packet. Further implementation experience will be required to see 
   whether this message size is within the MTU limits for the entire 
   NSIS message. The usage of a digital signature for a one-shot packet 
   would, however, allow an adversary located within the intra-domain 
   network to flood the QNF ingress or QNF egress with digitally signed 
   messages. This would require heavy computation by the target nodes 
   and could lead to a denial of service. The usage of an out-of-band 
   authentication and key exchange protocol extending the Internet Key 
   Exchange Protocol using a Domain of Interpretation is a good 
   alternative. An example of this approach was exercised in [RSVP-DOI].
   The QNF ingress node should know its QNF egress node based on either 
   an end-to-end signaling communication. In the reverse direction 
   routing state has already been established as part of GIMPS 
   signaling.

   Furthermore, it is necessary to enforce consistence checks within 
   the protocol itself. There are certain parameters in the QOS-NSLP 
   messages, such as RII and the <PDR NONCE> parameter that can be used 
   to enforce these checks. For example, it must be ensured that flows 
   belonging to a particular path are terminated when a congestion 
   Indication was received and not flows that travel a different path 
   through the RMD aware network domain. This check is necessary to 
   prevent malicious nodes to affect the entire network. The QNF 
   egress node needs to verify that only fields that are allowed to be 
   modified that are predefined for this purpose. This allows abnormal 
   behavior to be detected. For some scenarios, an additional 
   verification can be provided by matching the end-to-end signaling 
   communication with the intra-domain signaling communication, 
   see e.g., Section 3.2.2. 

   The congestion handling mechanism is very difficult to detect since 
   the malicious behavior might be hard to distinguish from regular 
   behavior. Hence, intrusion detection techniques and statistical 
   measurements could help to detect a malicious node within the RMD 
   aware network doamin. This technique has been suggested also for 
   DiffServ Codepoint packet marking (add ref. later). A general 
   observation can be made here that a router implementing a QoS 
   signaling protocol (and the RMD QOSM) can, similar to a router 
   without support for QoS signaling, do a lot of harm to a system. A 
   router can delay, drop, inject, duplicate or modify packets. A 
   certain degree of trust is, therefore, always assumed in most 
   systems when they are supposed to participate in the protocol 
   interaction. 
   

6.  IANA Considerations
   
   RMD-QOSM requires a new IANA registry.
   
Bader, et al.                                                 [Page 43]

INTERNET-DRAFT                                                 RMD-QOSM

7.  Open issues
   
   This section describes the open issues related to the RMD QoS 
   signaling model.  More details on open issues will be provided in a 
   future version of this draft.
   

7.1 Explicit congestion notification

   Explicit congestion notification (ECN) described in RFC 3168 might 
   be used to complement RMD basic functions. Congestion notification 
   can be based on queue management, e.g. RED.  ECN congestion 
   notification will be discussed in IETF62 and may be considered in 
   the next version of the draft.   

7.2 Bi-directional severe congestion handling

   The future version of this draft will describe the 
   bi-directional severe congestion handling within the RMD 
   aware domain when a bi-directional resource reservation 
   and/or resource query procedure is applied.


8.  Acknowledgments

   The authors express their acknowledgement to people who have worked 
   on the RMD concept: Z. Turanyi, R. Szabo, A. Csaszar, A. Takacs, G. 
   Pongracz, O. Pop, V. Rexhepi, D. Partain, M. Jacobsson, S. 
   Oosthoek, P. Wallentin, P. Goering, A. Stienstra, M. de Kogel.

9.  Authors' Addresses

   Attila Bader
   Traffic Lab
   Ericsson Research
   Ericsson Hungary Ltd.
   Laborc 1
   Budapest, Hungary, H-1037
   EMail: Attila.Bader@ericsson.com

   Lars Westberg
   Ericsson Research
   Torshamnsgatan 23
   SE-164 80 Stockholm, Sweden
   EMail: Lars.Westberg@ericsson.com

   Georgios Karagiannis
   University of Twente
   P.O.  BOX 217
   7500 AE Enschede, The Netherlands
   EMail: g.karagiannis@ewi.utwente.nl

Bader, et al.                                                 [Page 44]

INTERNET-DRAFT                                                 RMD-QOSM

   Cornelia Kappler
   Siemens AG
   Siemensdamm 62
   Berlin 13627, Germany
   Email: cornelia.kappler@siemens.com

   Hannes Tschofenig
   Siemens AG
   Otto-Hahn-Ring 6
   Munich  81739, Germany
   EMail: Hannes.Tschofenig@siemens.com

   Tom Phelan
   Sonus Networks
   250 Apollo Dr. 
   Chelmsford, MA USA 01824
   EMail: tphelan@sonusnet.com
   

10.  Normative References

   [QoS-NSLP] Bosch, S., Karagiannis, G.  and A.  McDonald, "NSLP for 
   Quality-of-Service signaling", draft-ietf-nsis-qos-nslp-05 (work 
   in progress), October 2004.

   [QSP-T] Ash, J., Bader, A., Kappler C., "QoS-NSLP QSpec Template" 
   draft-ietf-nsis-QSpec-02 (work in progress), June 2004.


11.  Informative References

   [RFC2205]  Braden, R., Zhang, L., Berson, S., Herzog, A., Jamin, S., 
   "Resource ReSerVation Protocol (RSVP)-- Version 1 Functional 
    Specification", IETF RFC 2205, 1997.

   [RFC2961]   Berger, L., Gan, D., Swallow, G., Pan, P., Tommasi, F. 
   and S. Molendini, "RSVP Refresh Overhead Reduction Extensions", 
   RFC 2961, April 2001.

   [RFC3175]  Baker, F., Iturralde, C. Le Faucher, F., Davie, B.,  
   "Aggregation of RSVP for IPv4 and IPv6 Reservations", 
   IETF RFC 3175, 2001.

   [GIMPS]  Schulzrinne, H., Hancock, R., "GIMPS: General Internet
   Messaging Protocol for Signaling", draft-ietf-nsis-ntlp-04 
   (work in progress), Oct 2004.

   [RFC1633] Braden R., Clark D., Shenker S., "Integrated Services in 
   the Internet Architecture: an Overview", RFC 1633

Bader, et al.                                                 [Page 45]

INTERNET-DRAFT                                                 RMD-QOSM

   [RFC2475] Blake, S., Black, D., Carlson, M., Davies, E., Wang, Z.
   and W.  Weiss, "An Architecture for Differentiated Services", RFC 
   2475, December 1998

   [RFC2638] Nichols K., Jacobson V., Zhang L.  "A Two-bit 
   Differentiated Services Architecture for the Internet", RFC 2638,
   July 1999

   [RMD1]  Westberg, L., et al., "Resource Management in Diffserv
   (RMD): A Functionality and Performance Behavior Overview", IFIP 
   PFHSN'02  

   [RMD2] G.  Karagiannis, et al., "RMD - a lightweight application 
   of NSIS" Networks 2004, Vienna, Austria.

   [RMD3] Marquetant A., Pop O., Szabo R., Dinnyes G., Turanyi Z., 
   "Novel Enhancements to Load Control - A Soft-State, Lightweight 
   Admission Control Protocol", Proceedings of the 2nd International 
   Workshop on Quality of future Internet Services, Coimbra, Portugal, 
   Sept 24-26, 2001, pp. 82-96.

   [RMD4] A. Csaszar et al., "Severe congestion handling with 
   resource management in diffserv on demand", Networking 2002  

   [RSVP-DOI] Tschofenig H., Schulzrinne H., "RSVP Domain of 
   Interpretation for ISAKMP ", draft-tschofenig-rsvp-doi-00.txt, 
   (work in progress), May 2003 

12.  Intellectual Property Statement

   IPR Statement about RMD

   I hereby give the following IPR Disclosure in relation to the RMD 
   concept proposed by Ericsson and currently under discussion in IEFT 
   WG NSIS:

   To the best of my knowledge there are no Ericsson patents or filed 
   patent applications on RMD protocol operation or basic principles.  
   To my knowledge there is only one Ericsson patent application family 
   that could possibly be relevant merely to particular implementation 
   of RMD.  This patent family comprises US patent 6687655 and 
   counterparts in other countries.

   To the best of my knowledge there is only one Ericsson owned 
   invention without any patent applications filed yet that could 
   possibly be relevant to particular implementation of RMD, but this 
   invention is not relevant to RMD protocol operation or basic 
   principles.

   I have been authorized by Ericsson to give the following Licensing 
   Declaration in relation to the RMD concept proposed by Ericsson and 
   discussed in IEFT WG NSIS:

Bader, et al.                                                 [Page 46]

INTERNET-DRAFT                                                 RMD-QOSM

   In case a license to a patent in the patent family above or a patent 
   issued/granted on an application for patent on the invention above 
   should be necessary for implementing any Internet Standard, Ericsson 
   is willing to grant to anybody a license to such patent on fair, 
   reasonable and non-discriminatory conditions for the implementation 
   of the standard, subject to reciprocity.

   Attila Bader

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed
   to pertain to the implementation or use of the technology
   described in this document or the extent to which any license
   under such rights might or might not be available; nor does it
   represent that it has made any independent effort to identify any
   such rights.  Information on the procedures with respect to rights
   in RFC documents can be found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use
   of such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository
   at http://www.ietf.org/ipr.


   The IETF invites any interested party to bring to its attention 
   any copyrights, patents or patent applications, or other 
   proprietary rights that may cover technology that may be required 
   to implement this standard.  Please address the information to the 
   IETF at ietf-ipr@ietf.org.


Copyright Statement

   Copyright (C) The Internet Society (2004).  This document is 
   subject to the rights, licenses and restrictions contained in BCP 
   78, and except as set forth therein, the authors retain all their 
   rights.


Disclaimer of validity:

   This document and the information contained herein are provided
   on an "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE
   REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND
   THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES,
   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT
   THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR
   ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A
   PARTICULAR PURPOSE."

